SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
					<description>DMA Channel 0 Source Address Register</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SRCADDR</name>
							<description>DMA source address. Reading this register will return the
								current source address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>DESTADDR%s</name>

					<description>DMA Channel 0 Destination Address Register</description>
					<addressOffset>0x104</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DESTADDR</name>
							<description>DMA Destination address. Reading this register will return
								the current destination address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>LLI%s</name>

					<description>DMA Channel 0 Linked List Item Register</description>
					<addressOffset>0x108</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, and must be written as 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>LLI</name>
							<description>Linked list item. Bits [31:2] of the address for the next
								LLI. Address bits [1:0] are 0.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>CONTROL%s</name>

					<description>DMA Channel 0 Control Register</description>
					<addressOffset>0x10C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRANSFERSIZE</name>
							<description>Transfer size. This field sets the size of the transfer
								when the DMA controller is the flow controller, in which case the
								value must be set before the channel is enabled. Transfer size is
								updated as data transfers are completed. A read from this field
								indicates the number of transfers completed on the destination bus.
								Reading the register when the channel is active does not give useful
								information because by the time that the software has processed the
								value read, the channel might have progressed. It is intended to be
								used only when a channel is enabled and then disabled. The transfer
								size value is not used if a peripheral is the flow controller.</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>SBSIZE</name>
							<description>Source burst size. Indicates the number of transfers that
								make up a source burst. This value must be set to the burst size of
								the source peripheral, or if the source is memory, to the memory
								boundary size. The burst size is the amount of data that is
								transferred when the DMACBREQ signal goes active in the source
								peripheral. 000 - 1 001 - 4 010 - 8 011 - 16 100 - 32 101 - 64 110 -
								128 111 - 256</description>
							<bitRange>[14:12]</bitRange>
						</field>
						<field>
							<name>DBSIZE</name>
							<description>Destination burst size. Indicates the number of transfers
								that make up a destination burst transfer request. This value must
								be set to the burst size of the destination peripheral or, if the
								destination is memory, to the memory boundary size. The burst size
								is the amount of data that is transferred when the DMACBREQ signal
								goes active in the destination peripheral. 000 - 1 001 - 4 010 - 8
								011 - 16 100 - 32 101 - 64 110 - 128 111 - 256</description>
							<bitRange>[17:15]</bitRange>
						</field>
						<field>
							<name>SWIDTH</name>
							<description>Source transfer width. The source and destination widths
								can be different from each other. The hardware automatically packs
								and unpacks the data as required. 000 - Byte (8-bit) 001 - Halfword
								(16-bit) 010 - Word (32-bit) 011 to 111 - Reserved</description>
							<bitRange>[20:18]</bitRange>
						</field>
						<field>
							<name>DWIDTH</name>
							<description>Destination transfer width. The source and destination
								widths can be different from each other. The hardware automatically
								packs and unpacks the data as required. 000 - Byte (8-bit) 001 -
								Halfword (16-bit) 010 - Word (32-bit) 011 to 111 - Reserved</description>
							<bitRange>[23:21]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, and must be written as 0.</description>
							<bitRange>[25:24]</bitRange>
						</field>
						<field>
							<name>SI</name>
							<description>Source increment: 0 - the source address is not incremented
								after each transfer. 1 - the source address is incremented after
								each transfer.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>DI</name>
							<description>Destination increment: 0 - the destination address is not
								incremented after each transfer. 1 - the destination address is
								incremented after each transfer.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>PROT1</name>
							<description>This is provided to the peripheral during a DMA bus access
								and indicates that the access is in user mode or privileged mode.
								This information is not used in the LPC178x/177x. 0 - access is in
								user mode. 1 - access is in privileged mode.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>PROT2</name>
							<description>This is provided to the peripheral during a DMA bus access
								and indicates to the peripheral that the access is bufferable or not
								bufferable. This information is not used in the LPC178x/177x. 0 -
								access is not bufferable. 1 - access is bufferable.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>PROT3</name>
							<description>This is provided to the peripheral during a DMA bus access
								and indicates to the peripheral that the access is cacheable or not
								cacheable. This information is not used in the LPC178x/177x. 0 -
								access is not cacheable. 1 - access is cacheable.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>I</name>
							<description>Terminal count interrupt enable bit. 0 - the terminal count
								interrupt is disabled. 1 - the terminal count interrupt is enabled.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>CHANNEL%s</name>

