SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>USB</name>
			<description>USB device/host/OTG controller</description>
			<groupName>USB</groupName>
			<baseAddress>0x2008C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USB</name>
				<value>24</value>
			</interrupt>
			<interrupt>
				<name>USB_NEED_CLK</name>
				<value>33</value>
			</interrupt>
			<registers>
				<register>
					<name>INTST</name>
					<description>OTG Interrupt Status</description>
					<addressOffset>0x100</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TMR</name>
							<description>Timer time-out.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>REMOVE_PU</name>
							<description>Remove pull-up. This bit is set by hardware to indicate
								that software needs to disable the D+ pull-up resistor.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>HNP_FAILURE</name>
							<description>HNP failed. This bit is set by hardware to indicate that
								the HNP switching has failed.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>HNP_SUCCESS</name>
							<description>HNP succeeded. This bit is set by hardware to indicate that
								the HNP switching has succeeded.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<description>OTG Interrupt Enable</description>
					<addressOffset>0x104</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TMR_EN</name>
							<description>1 = enable the corresponding bit in the IntSt register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>REMOVE_PU_EN</name>
							<description>1 = enable the corresponding bit in the IntSt register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>HNP_FAILURE_EN</name>
							<description>1 = enable the corresponding bit in the IntSt register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>HNP_SUCCES_EN</name>
							<description>1 = enable the corresponding bit in the IntSt register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSET</name>
					<description>OTG Interrupt Set</description>
					<addressOffset>0x108</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>TMR_SET</name>
							<description>0 = no effect. 1 = set the corresponding bit in the IntSt
								register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>REMOVE_PU_SET</name>
							<description>0 = no effect. 1 = set the corresponding bit in the IntSt
								register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>HNP_FAILURE_SET</name>
							<description>0 = no effect. 1 = set the corresponding bit in the IntSt
								register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>HNP_SUCCES_SET</name>
							<description>0 = no effect. 1 = set the corresponding bit in the IntSt
								register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTCLR</name>
					<description>OTG Interrupt Clear</description>
					<addressOffset>0x10C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>TMR_CLR</name>
							<description>0 = no effect. 1 = clear the corresponding bit in the IntSt
								register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>REMOVE_PU_CLR</name>
							<description>0 = no effect. 1 = clear the corresponding bit in the IntSt
								register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>HNP_FAILURE_CLR</name>
							<description>0 = no effect. 1 = clear the corresponding bit in the IntSt
								register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>HNP_SUCCES_CLR</name>
							<description>0 = no effect. 1 = clear the corresponding bit in the IntSt
								register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STCTRL</name>
					<description>OTG Status and Control and USB port select</description>
					<addressOffset>0x110</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PORT_FUNC</name>
							<description>Controls connection of USB functions (see Figure 51). Bit 0
								is set or cleared by hardware when B_HNP_TRACK or A_HNP_TRACK is set
								and HNP succeeds. See Section 14.9. 00: U1 = device (OTG), U2 = host
								01: U1 = host (OTG), U2 = host 10: Reserved 11: U1 = host, U2 =
								device In a device-only configuration, the following values are
								allowed: 00: U1 = device. The USB device controller signals are
								mapped to the U1 port: USB_CONNECT1, USB_UP_LED1, USB_D+1, USB_D-1.
								11: U2 = device. The USB device controller signals are mapped to the
								U2 port: USB_CONNECT2, USB_UP_LED2, USB_D+2, USB_D-2.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>TMR_SCALE</name>
							<description>Timer scale selection. This field determines the duration
								of each timer count. 00: 10 ms (100 KHz) 01: 100 ms (10 KHz) 10:
								1000 ms (1 KHz) 11: Reserved</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>TMR_MODE</name>
							<description>Timer mode selection. 0: monoshot 1: free running</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>TMR_EN</name>
							<description>Timer enable. When set, TMR_CNT increments. When cleared,
								TMR_CNT is reset to 0.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>TMR_RST</name>
							<description>Timer reset. Writing one to this bit resets TMR_CNT to 0.
								This provides a single bit control for the software to restart the
								timer when the timer is enabled.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>B_HNP_TRACK</name>
							<description>Enable HNP tracking for B-device (peripheral), see Section
								14.9. Hardware clears this bit when HNP_SUCCESS or HNP_FAILURE is
								set.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>A_HNP_TRACK</name>
							<description>Enable HNP tracking for A-device (host), see Section 14.9.
								Hardware clears this bit when HNP_SUCCESS or HNP_FAILURE is set.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PU_REMOVED</name>
							<description>When the B-device changes its role from peripheral to host,
								software sets this bit when it removes the D+ pull-up, see Section
								14.9. Hardware clears this bit when HNP_SUCCESS or HNP_FAILURE is
								set.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:11]</bitRange>
						</field>
						<field>
							<name>TMR_CNT</name>
							<description>Current timer count value.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TMR</name>
					<description>OTG Timer</description>
					<addressOffset>0x114</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TIMEOUT_CNT</name>
							<description>The TMR interrupt is set when TMR_CNT reaches this value.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>


				<register>
					<name>DEVINTST</name>
					<description>USB Device Interrupt Status</description>
					<addressOffset>0x200</addressOffset>
					<access>read-only</access>
					<resetValue>0x10</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAME</name>
							<description>The frame interrupt occurs every 1 ms. This is used in
								isochronous packet transfers.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP_FAST</name>
							<description>Fast endpoint interrupt. If an Endpoint Interrupt Priority
								register (USBEpIntPri) bit is set, the corresponding endpoint
								interrupt will be routed to this bit.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP_SLOW</name>
							<description>Slow endpoints interrupt. If an Endpoint Interrupt Priority
								Register (USBEpIntPri) bit is not set, the corresponding endpoint
								interrupt will be routed to this bit.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DEV_STAT</name>
							<description>Set when USB Bus reset, USB suspend change or Connect
								change event occurs. Refer to Section 13.12.6 Set Device Status
								(Command: 0xFE, Data: write 1 byte) on page 366.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CCEMPTY</name>
							<description>The command code register (USBCmdCode) is empty (New
								command can be written).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CDFULL</name>
							<description>Command data register (USBCmdData) is full (Data can be
								read now).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RxENDPKT</name>
							<description>The current packet in the endpoint buffer is transferred to
								the CPU.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>TxENDPKT</name>
							<description>The number of data bytes transferred to the endpoint buffer
								equals the number of bytes programmed in the TxPacket length
								register (USBTxPLen).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP_RLZED</name>
							<description>Endpoints realized. Set when Realize Endpoint register
								(USBReEp) or MaxPacketSize register (USBMaxPSize) is updated and the
								corresponding operation is completed.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ERR_INT</name>
							<description>Error Interrupt. Any bus error interrupt from the USB
								device. Refer to Section 13.12.9 Read Error Status (Command: 0xFB,
								Data: read 1 byte) on page 368</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVINTEN</name>
					<description>USB Device Interrupt Enable</description>
					<addressOffset>0x204</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAMEEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP_FASTEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP_SLOWEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DEV_STATEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CCEMPTYEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CDFULLEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RxENDPKTEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>TxENDPKTEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP_RLZEDEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ERR_INTEN</name>
							<description>0 = No interrupt is generated. 1 = An interrupt will be
								generated when the corresponding bit in the Device Interrupt Status
								(USBDevIntSt) register (Table 261) is set. By default, the interrupt
								is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
								the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
								interrupt line by changing the value of USBDevIntPri.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVINTCLR</name>
					<description>USB Device Interrupt Clear</description>
					<addressOffset>0x208</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAMECLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP_FASTCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP_SLOWCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DEV_STATCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CCEMPTYCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CDFULLCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RxENDPKTCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>TxENDPKTCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP_RLZEDCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ERR_INTCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
								(Section 13.10.3.2) is cleared.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
