SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>DV</name>
							<description>Data valid. This bit is useful for isochronous endpoints.
								Non-isochronous endpoints do not raise an interrupt when an
								erroneous data packet is received. But invalid data packet can be
								produced with a bus reset. For isochronous endpoints, data transfer
								will happen even if an erroneous packet is received. In this case DV
								bit will not be set for the packet.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>DV</name>
								<enumeratedValue>
									<name>INVALID</name>
									<description>Data is invalid.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Data is valid.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PKT_RDY</name>
							<description>The PKT_LNGTH field is valid and the packet is ready for
								reading.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:12]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>TXPLEN</name>
					<description>USB Transmit Packet Length</description>
					<addressOffset>0x224</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PKT_LNGTH</name>
							<description>The remaining number of bytes to be written to the selected
								endpoint buffer. This field is decremented by 4 by hardware after
								each write to USBTxData. When this field decrements to 0, the
								TxENDPKT bit will be set in USBDevIntSt.</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>USB Control</description>
					<addressOffset>0x228</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RD_EN</name>
							<description>Read mode control. Enables reading data from the OUT
								endpoint buffer for the endpoint specified in the LOG_ENDPOINT field
								using the USBRxData register. This bit is cleared by hardware when
								the last word of the current packet is read from USBRxData.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>RD_EN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WR_EN</name>
							<description>Write mode control. Enables writing data to the IN endpoint
								buffer for the endpoint specified in the LOG_ENDPOINT field using
								the USBTxData register. This bit is cleared by hardware when the
								number of bytes in USBTxLen have been sent.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>WR_EN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOG_ENDPOINT</name>
							<description>Logical Endpoint number.</description>
							<bitRange>[5:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>DEVINTPRI</name>
					<description>USB Device Interrupt Priority</description>
					<addressOffset>0x22C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAME</name>
							<description>Frame interrupt routing</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>FRAME</name>
								<enumeratedValue>
									<name>LP</name>
									<description>FRAME interrupt is routed to USB_INT_REQ_LP.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HP</name>
									<description>FRAME interrupt is routed to USB_INT_REQ_HP.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP_FAST</name>
							<description>Fast endpoint interrupt routing</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>EP_FAST</name>
								<enumeratedValue>
									<name>LP</name>
									<description>EP_FAST interrupt is routed to USB_INT_REQ_LP.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HP</name>
									<description>EP_FAST interrupt is routed to USB_INT_REQ_HP.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:2]</bitRange>

