SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>DMAINTEN</name>
					<description>USB DMA Interrupt Enable</description>
					<addressOffset>0x294</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EOT</name>
							<description>End of Transfer Interrupt enable bit.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>EOT</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NDDR</name>
							<description>New DD Request Interrupt enable bit.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>NDDR</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERR</name>
							<description>System Error Interrupt enable bit.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ERR</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>EOTINTST</name>
					<description>USB End of Transfer Interrupt Status</description>
					<addressOffset>0x2A0</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPTXINTST0</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPTXINTST1</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EPTXINTST2</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EPTXINTST3</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EPTXINTST4</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EPTXINTST5</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>EPTXINTST6</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>EPTXINTST7</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EPTXINTST8</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>EPTXINTST9</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>EPTXINTST10</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>EPTXINTST11</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>EPTXINTST12</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>EPTXINTST13</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>EPTXINTST14</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>EPTXINTST15</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>EPTXINTST16</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>EPTXINTST17</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>EPTXINTST18</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>EPTXINTST19</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>EPTXINTST20</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>EPTXINTST21</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>EPTXINTST22</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>EPTXINTST23</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>EPTXINTST24</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>EPTXINTST25</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>EPTXINTST26</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>EPTXINTST27</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>EPTXINTST28</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>EPTXINTST29</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>EPTXINTST30</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>EPTXINTST31</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer Interrupt
								request. 0 = There is no End of Transfer interrupt request for
								endpoint xx. 1 = There is an End of Transfer Interrupt request for
								endpoint xx.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EOTINTCLR</name>
					<description>USB End of Transfer Interrupt Clear</description>
					<addressOffset>0x2A4</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPTXINTCLR0</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPTXINTCLR1</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[1:1]</bitRange>

