SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPTXINTCLR21</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[21:21]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR22</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[22:22]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR23</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[23:23]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR24</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[24:24]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR25</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[25:25]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR26</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[26:26]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR27</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR28</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[28:28]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR29</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[29:29]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR30</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[30:30]</bitRange>

						</field>
						<field>
							<name>EPTXINTCLR31</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>EOTINTSET</name>
					<description>USB End of Transfer Interrupt Set</description>
					<addressOffset>0x2A8</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPTXINTSET0</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET1</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET2</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET3</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET4</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET5</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET6</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[6:6]</bitRange>

