SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPTXINTSET26</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[26:26]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET27</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET28</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[28:28]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET29</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[29:29]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET30</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[30:30]</bitRange>

						</field>
						<field>
							<name>EPTXINTSET31</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
								Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
								Interrupt request in the USBEoTIntSt register.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>NDDRINTST</name>
					<description>USB New DD Request Interrupt Status</description>
					<addressOffset>0x2AC</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPNDDINTST0</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST1</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST2</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST3</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST4</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST5</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST6</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST7</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST8</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST9</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST10</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST11</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[11:11]</bitRange>

