SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPNDDINTST12</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST13</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST14</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST15</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST16</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[16:16]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST17</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST18</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[18:18]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST19</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[19:19]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST20</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[20:20]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST21</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[21:21]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST22</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[22:22]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST23</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[23:23]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST24</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[24:24]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST25</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[25:25]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST26</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[26:26]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST27</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST28</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[28:28]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST29</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[29:29]</bitRange>

						</field>
						<field>
							<name>EPNDDINTST30</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[30:30]</bitRange>

