SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPNDDINTST31</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt request.
								0 = There is no new DD interrupt request for endpoint xx. 1 = There
								is a new DD interrupt request for endpoint xx.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>NDDRINTCLR</name>
					<description>USB New DD Request Interrupt Clear</description>
					<addressOffset>0x2B0</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPNDDINTCLR0</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR1</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR2</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR3</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR4</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR5</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR6</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR7</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR8</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR9</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR10</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR11</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR12</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR13</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR14</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR15</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR16</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[16:16]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR17</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[17:17]</bitRange>

