SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPNDDINTCLR18</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[18:18]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR19</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[19:19]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR20</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[20:20]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR21</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[21:21]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR22</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[22:22]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR23</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[23:23]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR24</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[24:24]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR25</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[25:25]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR26</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[26:26]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR27</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR28</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[28:28]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR29</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[29:29]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR30</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[30:30]</bitRange>

						</field>
						<field>
							<name>EPNDDINTCLR31</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request
								in the USBNDDRIntSt register.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>NDDRINTSET</name>
					<description>USB New DD Request Interrupt Set</description>
					<addressOffset>0x2B4</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPNDDINTSET0</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET1</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET2</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET3</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET4</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[4:4]</bitRange>

