SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPNDDINTSET5</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET6</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET7</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET8</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET9</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET10</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET11</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET12</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET13</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET14</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET15</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET16</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[16:16]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET17</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET18</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[18:18]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET19</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[19:19]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET20</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[20:20]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET21</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[21:21]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET22</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[22:22]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET23</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[23:23]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET24</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[24:24]</bitRange>

