SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPNDDINTSET25</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[25:25]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET26</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[26:26]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET27</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET28</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[28:28]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET29</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[29:29]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET30</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[30:30]</bitRange>

						</field>
						<field>
							<name>EPNDDINTSET31</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) new DD interrupt
								request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in
								the USBNDDRIntSt register.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SYSERRINTST</name>
					<description>USB System Error Interrupt Status</description>
					<addressOffset>0x2B8</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPERRINTST0</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>EPERRINTST1</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EPERRINTST2</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EPERRINTST3</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EPERRINTST4</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>EPERRINTST5</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>EPERRINTST6</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>EPERRINTST7</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>EPERRINTST8</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>EPERRINTST9</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>EPERRINTST10</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[10:10]</bitRange>

