SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPERRINTST11</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>EPERRINTST12</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>EPERRINTST13</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>EPERRINTST14</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>EPERRINTST15</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>EPERRINTST16</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[16:16]</bitRange>

						</field>
						<field>
							<name>EPERRINTST17</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>EPERRINTST18</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[18:18]</bitRange>

						</field>
						<field>
							<name>EPERRINTST19</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[19:19]</bitRange>

						</field>
						<field>
							<name>EPERRINTST20</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[20:20]</bitRange>

						</field>
						<field>
							<name>EPERRINTST21</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[21:21]</bitRange>

						</field>
						<field>
							<name>EPERRINTST22</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[22:22]</bitRange>

						</field>
						<field>
							<name>EPERRINTST23</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[23:23]</bitRange>

						</field>
						<field>
							<name>EPERRINTST24</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[24:24]</bitRange>

						</field>
						<field>
							<name>EPERRINTST25</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[25:25]</bitRange>

						</field>
						<field>
							<name>EPERRINTST26</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[26:26]</bitRange>

						</field>
						<field>
							<name>EPERRINTST27</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>EPERRINTST28</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[28:28]</bitRange>

