SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPERRINTST29</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[29:29]</bitRange>

						</field>
						<field>
							<name>EPERRINTST30</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[30:30]</bitRange>

						</field>
						<field>
							<name>EPERRINTST31</name>
							<description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
								request. 0 = There is no System Error Interrupt request for endpoint
								xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SYSERRINTCLR</name>
					<description>USB System Error Interrupt Clear</description>
					<addressOffset>0x2BC</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPERRINTCLR0</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR1</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR2</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR3</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR4</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR5</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR6</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR7</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR8</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR9</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR10</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR11</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR12</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR13</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR14</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[14:14]</bitRange>

