SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPERRINTCLR15</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR16</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[16:16]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR17</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR18</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[18:18]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR19</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[19:19]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR20</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[20:20]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR21</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[21:21]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR22</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[22:22]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR23</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[23:23]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR24</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[24:24]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR25</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[25:25]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR26</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[26:26]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR27</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR28</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[28:28]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR29</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[29:29]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR30</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[30:30]</bitRange>

						</field>
						<field>
							<name>EPERRINTCLR31</name>
							<description>Clear endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SYSERRINTSET</name>
					<description>USB System Error Interrupt Set</description>
					<addressOffset>0x2C0</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPERRINTSET0</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[0:0]</bitRange>

