SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPERRINTSET1</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET2</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET3</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET4</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET5</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET6</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET7</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET8</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET9</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET10</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET11</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET12</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET13</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET14</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET15</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET16</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[16:16]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET17</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET18</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[18:18]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET19</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[19:19]</bitRange>

