SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EPERRINTSET20</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[20:20]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET21</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[21:21]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET22</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[22:22]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET23</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[23:23]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET24</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[24:24]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET25</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[25:25]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET26</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[26:26]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET27</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET28</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[28:28]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET29</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[29:29]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET30</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[30:30]</bitRange>

						</field>
						<field>
							<name>EPERRINTSET31</name>
							<description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
								Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
								Interrupt request in the USBSysErrIntSt register.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>


				<register>
					<name>I2C_RX</name>
					<description>I2C Receive</description>
					<addressOffset>0x300</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RXDATA</name>
							<description>Receive data.</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_WO</name>
					<description>I2C Transmit</description>
					<alternateRegister>I2C_RX</alternateRegister>
					<addressOffset>0x300</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>TXDATA</name>
							<description>Transmit data.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>START</name>
							<description>When 1, issue a START condition before transmitting this
								byte.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>STOP</name>
							<description>When 1, issue a STOP condition after transmitting this
								byte.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_STS</name>
					<description>I2C Status</description>
					<addressOffset>0x304</addressOffset>
					<access>read-only</access>
					<resetValue>0x0A00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TDI</name>
							<description>Transaction Done Interrupt. This flag is set if a
								transaction completes successfully. It is cleared by writing a one
								to bit 0 of the status register. It is unaffected by slave
								transactions.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>TDI</name>
								<enumeratedValue>
									<name>NOT_COMPLETE</name>
									<description>Transaction has not completed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMPLETE</name>
									<description>Transaction completed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AFI</name>
							<description>Arbitration Failure Interrupt. When transmitting, if the
								SDA is low when SDAOUT is high, then this I2C has lost the
								arbitration to another device on the bus. The Arbitration Failure
								bit is set when this happens. It is cleared by writing a one to bit
								1 of the status register.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>AFI</name>
								<enumeratedValue>
									<name>NO_ARB_FAILURE</name>
									<description>No arbitration failure on last transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ARB_FAILURE</name>
									<description>Arbitration failure occurred on last transmission.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NAI</name>
							<description>No Acknowledge Interrupt. After every byte of data is sent,
								the transmitter expects an acknowledge from the receiver. This bit
								is set if the acknowledge is not received. It is cleared when a byte
								is written to the master TX FIFO.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>NAI</name>
								<enumeratedValue>
									<name>ACK_RCVD</name>
									<description>Last transmission received an acknowledge.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_ACK_RCVD</name>
									<description>Last transmission did not receive an acknowledge.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRMI</name>
							<description>Master Data Request Interrupt. Once a transmission is
								started, the transmitter must have data to transmit as long as it
								isn't followed by a stop condition or it will hold SCL low until
								more data is available. The Master Data Request bit is set when the
								master transmitter is data-starved. If the master TX FIFO is empty
								and the last byte did not have a STOP condition flag, then SCL is
								held low until the CPU writes another byte to transmit. This bit is
								cleared when a byte is written to the master TX FIFO.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>DRMI</name>
								<enumeratedValue>
									<name>BUSY</name>
									<description>Master transmitter does not need data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NEED_DATA</name>
									<description>Master transmitter needs data.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRSI</name>
							<description>Slave Data Request Interrupt. Once a transmission is
								started, the transmitter must have data to transmit as long as it
								isn't followed by a STOP condition or it will hold SCL low until
								more data is available. The Slave Data Request bit is set when the
								slave transmitter is data-starved. If the slave TX FIFO is empty and
								the last byte transmitted was acknowledged, then SCL is held low
								until the CPU writes another byte to transmit. This bit is cleared
								when a byte is written to the slave Tx FIFO.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>DRSI</name>
								<enumeratedValue>
									<name>BUSY</name>
									<description>Slave transmitter does not need data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NEED_DATA</name>
									<description>Slave transmitter needs data.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Active</name>
							<description>Indicates whether the bus is busy. This bit is set when a
								START condition has been seen. It is cleared when a STOP condition
								is seen..</description>
							<bitRange>[5:5]</bitRange>

