SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>SCL</name>
							<description>The current value of the SCL signal.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>SDA</name>
							<description>The current value of the SDA signal.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>RFF</name>
							<description>Receive FIFO Full (RFF). This bit is set when the RX FIFO
								is full and cannot accept any more data. It is cleared when the RX
								FIFO is not full. If a byte arrives when the Receive FIFO is full,
								the SCL is held low until the CPU reads the RX FIFO and makes room
								for it.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>RFF</name>
								<enumeratedValue>
									<name>NOT_FULL</name>
									<description>RX FIFO is not full</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>RX FIFO is full</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RFE</name>
							<description>Receive FIFO Empty. RFE is set when the RX FIFO is empty
								and is cleared when the RX FIFO contains valid data.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>RFE</name>
								<enumeratedValue>
									<name>VALID_DATA</name>
									<description>RX FIFO contains data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>RX FIFO is empty</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFF</name>
							<description>Transmit FIFO Full. TFF is set when the TX FIFO is full and
								is cleared when the TX FIFO is not full.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>TFF</name>
								<enumeratedValue>
									<name>NOT_FULL</name>
									<description>TX FIFO is not full.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>TX FIFO is full</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFE</name>
							<description>Transmit FIFO Empty. TFE is set when the TX FIFO is empty
								and is cleared when the TX FIFO contains valid data.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>TFE</name>
								<enumeratedValue>
									<name>VALID_DATA</name>
									<description>TX FIFO contains valid data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>TX FIFO is empty</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>I2C_CTL</name>
					<description>I2C Control</description>
					<addressOffset>0x308</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TDIE</name>
							<description>Transmit Done Interrupt Enable. This enables the TDI
								interrupt signalling that this I2C issued a STOP condition.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>TDIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the TDI interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the TDI interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AFIE</name>
							<description>Transmitter Arbitration Failure Interrupt Enable. This
								enables the AFI interrupt which is asserted during transmission when
								trying to set SDA high, but the bus is driven low by another device.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>AFIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AFI.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AFI.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NAIE</name>
							<description>Transmitter No Acknowledge Interrupt Enable. This enables
								the NAI interrupt signalling that transmitted byte was not
								acknowledged.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>NAIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the NAI.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the NAI.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRMIE</name>
							<description>Master Transmitter Data Request Interrupt Enable. This
								enables the DRMI interrupt which signals that the master transmitter
								has run out of data, has not issued a STOP, and is holding the SCL
								line low.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>DRMIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DRMI interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DRMI interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRSIE</name>
							<description>Slave Transmitter Data Request Interrupt Enable. This
								enables the DRSI interrupt which signals that the slave transmitter
								has run out of data and the last byte was acknowledged, so the SCL
								line is being held low.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>DRSIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DRSI interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DRSI interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFIE</name>
							<description>Receive FIFO Full Interrupt Enable. This enables the
								Receive FIFO Full interrupt to indicate that the receive FIFO cannot
								accept any more data.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>REFIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the RFFI.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the RFFI.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RFDAIE</name>
							<description>Receive Data Available Interrupt Enable. This enables the
								DAI interrupt to indicate that data is available in the receive FIFO
								(i.e. not empty).</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>RFDAIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DAI.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DAI.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFFIE</name>
							<description>Transmit FIFO Not Full Interrupt Enable. This enables the
								Transmit FIFO Not Full interrupt to indicate that the more data can
								be written to the transmit FIFO. Note that this is not full. It is
								intended help the CPU to write to the I2C block only when there is
								room in the FIFO and do this without polling the status register.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>TFFIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the TFFI.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the TFFI.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRST</name>
							<description>Soft reset. This is only needed in unusual circumstances.
								If a device issues a start condition without issuing a stop
								condition. A system timer may be used to reset the I2C if the bus
								remains busy longer than the time-out period. On a soft reset, the
								Tx and Rx FIFOs are flushed, I2C_STS register is cleared, and all
								internal state machines are reset to appear idle. The I2C_CLKHI,
								I2C_CLKLO and I2C_CTL (except Soft Reset Bit) are NOT modified by a
								soft reset.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>SRST</name>
								<enumeratedValue>
									<name>NO_RESET</name>
									<description>No reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset the I2C to idle state. Self clearing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:9]</bitRange>

