SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>USBCLKST</name>
					<description>USB Clock Status</description>

					<addressOffset>0xFF8</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DEV_CLK_ON</name>
							<description>Device clock on. The usbclk input to the device controller
								is active .</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PORTSEL_CLK_ON</name>
							<description>Port select register clock on.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>AHB_CLK_ON</name>
							<description>AHB clock on.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>OTGCLKST</name>
					<description>OTG clock status</description>
					<alternateRegister>USBCLKST</alternateRegister>
					<addressOffset>0xFF8</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HOST_CLK_ON</name>
							<description>Host clock status.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>HOST_CLK_ON</name>
								<enumeratedValue>
									<name>NOT_AVAILABLE</name>
									<description>Host clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVAILABLE</name>
									<description>Host clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DEV_CLK_ON</name>
							<description>Device clock status.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>DEV_CLK_ON</name>
								<enumeratedValue>
									<name>NOT_AVAILABLE</name>
									<description>Device clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVAILABLE</name>
									<description>Device clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2C_CLK_ON</name>
							<description>I2C clock status.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>I2C_CLK_ON</name>
								<enumeratedValue>
									<name>NOT_AVAILABLE</name>
									<description>I2C clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVAILABLE</name>
									<description>I2C clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OTG_CLK_ON</name>
							<description>OTG clock status.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>OTG_CLK_ON</name>
								<enumeratedValue>
									<name>NOT_AVAILABLE</name>
									<description>OTG clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVAILABLE</name>
									<description>OTG clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AHB_CLK_ON</name>
							<description>AHB master clock status.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>AHB_CLK_ON</name>
								<enumeratedValue>
									<name>NOT_AVAILABLE</name>
									<description>AHB clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVAILABLE</name>
									<description>AHB clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:5]</bitRange>

						</field>
					</fields>
				</register>


			</registers>
		</peripheral>

		<peripheral>
			<name>CRC</name>
			<description>CRC engine </description>
			<groupName>CRC</groupName>
			<baseAddress>0x20090000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MODE</name>
					<description>CRC mode register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_POLY</name>
							<description>Select CRC polynomial</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>CRC_POLY</name>
								<enumeratedValue>
									<name>CRC_CCITT</name>
									<description>CRC-CCITT polynomial</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRC_16</name>
									<description>CRC-16 polynomial</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRC_32</name>
									<description>CRC-32 polynomial</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BIT_RVS_WR</name>
							<description>Select bit order for CRC_WR_DATA</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>BIT_RVS_WR</name>
								<enumeratedValue>
									<name>NO_REVERSE</name>
									<description>No bit order reverse for CRC_WR_DATA (per byte)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE</name>
									<description>Bit order reverse for CRC_WR_DATA (per byte)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPL_WR</name>
							<description>Select one's complement for CRC_WR_DATA</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>CMPL_WR</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No one's complement for CRC_WR_DATA</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>One's complement for CRC_WR_DATA</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BIT_RVS_SUM</name>
							<description>Select bit order revers for CRC_SUM</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>BIT_RVS_SUM</name>
								<enumeratedValue>
									<name>NO_REVERSE</name>
									<description>No bit order reverse for CRC_SUM</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE</name>
									<description>Bit order reverse for CRC_SUM</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPL_SUM</name>
							<description>Select one's complement for CRC_SUM</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>CMPL_SUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No one's complement for CRC_SUM</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>One's complement for CRC_SUM</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Reserved</name>
							<description>Always 0 when read</description>
							<bitRange>[31:6]</bitRange>

