SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<dim>6</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-5</dimIndex>
					<name>MASK%s</name>
					<description>Mask register for Port0.</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PINMASK0</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PINMASK1</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PINMASK2</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PINMASK3</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PINMASK4</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PINMASK5</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>PINMASK6</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>PINMASK7</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>PINMASK8</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>PINMASK9</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PINMASK10</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>PINMASK11</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>PINMASK12</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>PINMASK13</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>PINMASK14</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>PINMASK15</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>PINMASK16</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>PINMASK17</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>PINMASK18</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>PINMASK19</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>PINMASK20</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>PINMASK21</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>PINMASK22</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>PINMASK23</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PINMASK24</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>PINMASK25</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>PINMASK26</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>PINMASK27</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>PINMASK28</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>PINMASK29</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>PINMASK30</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>PINMASK31</name>
							<description>Fast GPIO physical pin access control. 0 = Controlled pin
								is affected by writes to the port's SETx, CLRx, and PINx
								register(s). Current state of the pin can be read from the PINx
								register. 1 = Controlled pin is not affected by writes into the
								port's SETx, CLRx and PINx register(s). When the PINx register is
								read, this bit will not be updated with the state of the physical
								pin.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
