SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>CLKR</name>
							<description>CCLK: CLKOUT ratio. This bit must contain 0 for proper
								operation of the EMC.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>CLKR</name>
								<enumeratedValue>
									<name>PORRESET</name>
									<description>1:1(POR reset value)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>1:2 (this option is not available on the
										LPC178x/177x)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:9]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICCONTROL</name>
					<description>Controls dynamic memory operation.</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x006</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CE</name>
							<description>Dynamic memory clock enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>CE</name>
								<enumeratedValue>
									<name>POWERSAVE</name>
									<description>Clock enable of idle devices are deasserted to save
										power (POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>All clock enables are driven HIGH continuously.[1]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CS</name>
							<description>Dynamic memory clock control. When clock control is LOW the
								output clock CLKOUT is stopped when there are no SDRAM transactions.
								The clock is also stopped during self-refresh mode.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>CS</name>
								<enumeratedValue>
									<name>STOP_ON_IDLE</name>
									<description>CLKOUT stops when all SDRAMs are idle and during
										self-refresh mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONTINUOUS</name>
									<description>CLKOUT runs continuously (POR reset value).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SR</name>
							<description>Self-refresh request, EMCSREFREQ. By writing 1 to this bit
								self-refresh can be entered under software control. Writing 0 to
								this bit returns the EMC to normal mode. The self-refresh
								acknowledge bit in the Status register must be polled to discover
								the current operating mode of the EMC.[2]</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>SR</name>
								<enumeratedValue>
									<name>NORMAL_MODE</name>
									<description>Normal mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELF_REFRESH_MODE</name>
									<description>Enter self-refresh mode (POR reset value).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[4:3]</bitRange>

						</field>
						<field>
							<name>MMC</name>
							<description>Memory clock control.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>MMC</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>CLKOUT enabled (POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>CLKOUT disabled.[3]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>I</name>
							<description>SDRAM initialization.</description>
							<bitRange>[8:7]</bitRange>
							<enumeratedValues>
								<name>I</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Issue SDRAM NORMAL operation command (POR reset
										value).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE</name>
									<description>Issue SDRAM MODE command.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PALL</name>
									<description>Issue SDRAM PALL (precharge all) command.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOP</name>
									<description>Issue SDRAM NOP (no operation) command)</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[13:9]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:14]</bitRange>

