SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>MD</name>
							<description>Memory device.</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MD</name>
								<enumeratedValue>
									<name>SDRAM</name>
									<description>SDRAM (POR reset value).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_POWER_SDRAM</name>
									<description>Low-power SDRAM.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:5]</bitRange>

						</field>
						<field>
							<name>AM0</name>
							<description>See Table 133. 000000 = reset value.[1]</description>
							<bitRange>[12:7]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>AM1</name>
							<description>See Table 133. 0 = reset value.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[18:15]</bitRange>

						</field>
						<field>
							<name>B</name>
							<description>Buffer enable.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>B</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Buffer disabled for accesses to this chip select
										(POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Buffer enabled for accesses to this chip select.[2]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P</name>
							<description>Write protect.</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>P</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Writes not protected (POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Writes protected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:21]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>DYNAMICRASCAS%s</name>

					<description>RAS and CAS latencies for EMC_DYCS0.</description>
					<addressOffset>0x104</addressOffset>
					<access>read-write</access>
					<resetValue>0x303</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RAS</name>
							<description>RAS latency (active to read/write delay).</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>RAS</name>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE_CCLK</name>
									<description>One CCLK cycle.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO_CCLK</name>
									<description>Two CCLK cycles.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREE_CCLK</name>
									<description>Three CCLK cycles (POR reset value).</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[7:2]</bitRange>

						</field>
						<field>
							<name>CAS</name>
							<description>CAS latency.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>CAS</name>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE_CYCLE</name>
									<description>One CCLK cycle.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO_CYCLES</name>
									<description>Two CCLK cycles.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREE_CYCLES</name>
									<description>Three CCLK cycles (POR reset value).</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:10]</bitRange>

