SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>STATICCONFIG%s</name>

					<description>Configuration for EMC_CS0.</description>
					<addressOffset>0x200</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MW</name>
							<description>Memory width.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>MW</name>
								<enumeratedValue>
									<name>8_BIT</name>
									<description>8 bit (POR reset value).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_BIT</name>
									<description>16 bit.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_BIT</name>
									<description>32 bit.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>PM</name>
							<description>Page mode. In page mode the EMC can burst up to four
								external accesses. Therefore devices with asynchronous page mode
								burst four or higher devices are supported. Asynchronous page mode
								burst two devices are not supported and must be accessed normally.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>PM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled (POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Asynchronous page mode enabled (page length four).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[5:4]</bitRange>

						</field>
						<field>
							<name>PC</name>
							<description>Chip select polarity. The value of the chip select polarity
								on power-on reset is 0.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>PC</name>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Active LOW chip select.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Active HIGH chip select.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB</name>
							<description>Byte lane state. The byte lane state bit, PB, enables
								different types of memory to be connected. For byte-wide static
								memories the BLS3:0 signal from the EMC is usually connected to WE
								(write enable). In this case for reads all the BLS3:0 bits must be
								HIGH. This means that the byte lane state (PB) bit must be LOW. 16
								bit wide static memory devices usually have the BLS3:0 signals
								connected to the UBn and LBn (upper byte and lower byte) signals in
								the static memory. In this case a write to a particular byte must
								assert the appropriate UBn or LBn signal LOW. For reads, all the UB
								and LB signals must be asserted LOW so that the bus is driven. In
								this case the byte lane state (PB) bit must be HIGH.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>PB</name>
								<enumeratedValue>
									<name>BLSHIGH</name>
									<description>For reads all the bits in BLS3:0 are HIGH. For
										writes the respective active bits in BLS3:0 are LOW (POR
										reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BLSLOW</name>
									<description>For reads the respective active bits in BLS3:0 are
										LOW. For writes the respective active bits in BLS3:0 are
										LOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EW</name>
							<description>Extended wait (EW) uses the EMCStaticExtendedWait register
								to time both the read and write transfers rather than the
								EMCStaticWaitRd and EMCStaticWaitWr registers. This enables much
								longer transactions. [1]</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>EW</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Extended wait disabled (POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Extended wait enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[18:9]</bitRange>

						</field>
						<field>
							<name>B</name>
							<description>Buffer enable [2]</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>B</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Buffer disabled (POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Buffer enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P</name>
							<description>Write protect</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>P</name>
								<enumeratedValue>
									<name>NOT_PROTECTED</name>
									<description>Writes not protected (POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PROTECTED</name>
									<description>Write protected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:21]</bitRange>

