SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MR[%s]</name>
					<displayName>MR[%s]</displayName>
					<description>Match Register 0. MR0 can be enabled through the MCR to reset the
						TC, stop both the TC and PC, and/or generate an interrupt every time MR0
						matches the TC.</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCH</name>
							<description>Timer counter match value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Capture Control Register. The CCR controls which edges of the
						capture inputs are used to load the Capture Registers and whether or not an
						interrupt is generated when a capture takes place.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP0RE</name>
							<description>Capture on CAPn.0 rising edge</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>CAP0RE</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A sequence of 0 then 1 on CAPn.0 will cause CR0 to
										be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0FE</name>
							<description>Capture on CAPn.0 falling edge</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>CAP0FE</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A sequence of 1 then 0 on CAPn.0 will cause CR0 to
										be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0I</name>
							<description>Interrupt on CAPn.0 event</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>CAP0I</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A CR0 load due to a CAPn.0 event will generate an
										interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1RE</name>
							<description>Capture on CAPn.1 rising edge</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>CAP1RE</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A sequence of 0 then 1 on CAPn.1 will cause CR1 to
										be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1FE</name>
							<description>Capture on CAPn.1 falling edge</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>CAP1FE</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A sequence of 1 then 0 on CAPn.1 will cause CR1 to
										be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1I</name>
							<description>Interrupt on CAPn.1 event</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>CAP1I</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A CR1 load due to a CAPn.1 event will generate an
										interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CR[%s]</name>
					<displayName>CR[%s]</displayName>
					<description>Capture Register 0. CR0 is loaded with the value of TC when there
						is an event on the CAPn.0 input.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP</name>
							<description>Timer counter capture value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EMR</name>
					<description>External Match Register. The EMR controls the external match pins.</description>
					<addressOffset>0x03C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EM0</name>
							<description>External Match 0. When a match occurs between the TC and
								MR0, this bit can either toggle, go low, go high, or do nothing,
								depending on bits 5:4 of this register. This bit can be driven onto
								a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
							<bitRange>[0:0]</bitRange>

