SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>EM1</name>
							<description>External Match 1. When a match occurs between the TC and
								MR1, this bit can either toggle, go low, go high, or do nothing,
								depending on bits 7:6 of this register. This bit can be driven onto
								a MATn.1 pin, in a positive-logic manner (0 = low, 1 = high).</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EM2</name>
							<description>External Match 2. When a match occurs between the TC and
								MR2, this bit can either toggle, go low, go high, or do nothing,
								depending on bits 9:8 of this register. This bit can be driven onto
								a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EM3</name>
							<description>External Match 3. When a match occurs between the TC and
								MR3, this bit can either toggle, go low, go high, or do nothing,
								depending on bits 11:10 of this register. This bit can be driven
								onto a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EMC0</name>
							<description>External Match Control 0. Determines the functionality of
								External Match 0.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>EMC0</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear the corresponding External Match bit/output
										to 0 (MATn.m pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set the corresponding External Match bit/output to
										1 (MATn.m pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC1</name>
							<description>External Match Control 1. Determines the functionality of
								External Match 1.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>EMC1</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear the corresponding External Match bit/output
										to 0 (MATn.m pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set the corresponding External Match bit/output to
										1 (MATn.m pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC2</name>
							<description>External Match Control 2. Determines the functionality of
								External Match 2.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>EMC2</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear the corresponding External Match bit/output
										to 0 (MATn.m pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set the corresponding External Match bit/output to
										1 (MATn.m pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC3</name>
							<description>External Match Control 3. Determines the functionality of
								External Match 3.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>EMC3</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear the corresponding External Match bit/output
										to 0 (MATn.m pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set the corresponding External Match bit/output to
										1 (MATn.m pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>

