SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>CTCR</name>
					<description>Count Control Register. The CTCR selects between Timer and Counter
						mode, and in Counter mode selects the signal and edge(s) for counting.</description>
					<addressOffset>0x070</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CTMODE</name>
							<description>Counter/Timer Mode This field selects which rising PCLK
								edges can increment Timer's Prescale Counter (PC), or clear PC and
								increment Timer Counter (TC). Timer Mode: the TC is incremented when
								the Prescale Counter matches the Prescale Register.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>CTMODE</name>
								<enumeratedValue>
									<name>TRISING</name>
									<description>Timer Mode: every rising PCLK edge</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRISING</name>
									<description>Counter Mode: TC is incremented on rising edges on
										the CAP input selected by bits 3:2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CFALLING</name>
									<description>Counter Mode: TC is incremented on falling edges on
										the CAP input selected by bits 3:2.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CDUALEDGE</name>
									<description>Counter Mode: TC is incremented on both edges on
										the CAP input selected by bits 3:2.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CINSEL</name>
							<description>Count Input Select When bits 1:0 in this register are not
								00, these bits select which CAP pin is sampled for clocking. Note:
								If Counter mode is selected for a particular CAPn input in the
								TnCTCR, the 3 bits for that input in the Capture Control Register
								(TnCCR) must be programmed as 000. However, capture and/or interrupt
								can be selected for the other 3 CAPn inputs in the same timer.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>CINSEL</name>
								<enumeratedValue>
									<name>CAPN_0</name>
									<description>CAPn.0 for TIMERn</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPN_1</name>
									<description>CAPn.1 for TIMERn</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>

						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral derivedFrom="TIMER0">
			<name>TIMER1</name>
			<baseAddress>0x40008000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER1</name>
				<value>2</value>
			</interrupt>
		</peripheral>


		<peripheral>
			<name>UART0</name>
			<description>UART0/2/3 </description>
			<groupName>UART0</groupName>
			<baseAddress>0x4000C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART0</name>
				<value>5</value>
			</interrupt>
			<registers>
				<register>
					<name>RBR</name>
					<description>Receiver Buffer Register. Contains the next received character to
						be read (DLAB =0).</description>
					<addressOffset>0x000</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>RBR</name>
							<description>The UARTn Receiver Buffer Register contains the oldest
								received byte in the UARTn Rx FIFO.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>THR</name>
					<description>Transmit Holding Regiter. The next character to be transmitted is
						written here (DLAB =0).</description>
					<alternateRegister>RBR</alternateRegister>
					<addressOffset>0x000</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Writing to the UARTn Transmit Holding Register causes the
								data to be stored in the UARTn transmit FIFO. The byte will be sent
								when it reaches the bottom of the FIFO and the transmitter is
								available.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DLL</name>
					<description>Divisor Latch LSB. Least significant byte of the baud rate divisor
						value. The full divisor is used to generate a baud rate from the fractional
						rate divider (DLAB =1).</description>
					<alternateRegister>RBR</alternateRegister>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x01</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLLSB</name>
							<description>The UARTn Divisor Latch LSB Register, along with the UnDLM
								register, determines the baud rate of the UARTn.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DLM</name>
					<description>Divisor Latch MSB. Most significant byte of the baud rate divisor
						value. The full divisor is used to generate a baud rate from the fractional
						rate divider (DLAB =1).</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLMSB</name>
							<description>The UARTn Divisor Latch MSB Register, along with the U0DLL
								register, determines the baud rate of the UARTn.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<description>Interrupt Enable Register. Contains individual interrupt enable
						bits for the 7 potential UART interrupts (DLAB =0).</description>
					<alternateRegister>DLM</alternateRegister>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RBRIE</name>
							<description>RBR Interrupt Enable. Enables the Receive Data Available
								interrupt for UARTn. It also controls the Character Receive Time-out
								interrupt.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>RBRIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the RDA interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the RDA interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THREIE</name>
							<description>THRE Interrupt Enable. Enables the THRE interrupt for
								UARTn. The status of this can be read from UnLSR[5].</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>THREIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the THRE interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the THRE interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIE</name>
							<description>RX Line Status Interrupt Enable. Enables the UARTn RX line
								status interrupts. The status of this interrupt can be read from
								UnLSR[4:1].</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>RXIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the RX line status interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the RX line status interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:3]</bitRange>

