SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>SCR</name>
					<description>Scratch Pad Register. 8-bit temporary storage for software.</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PAD</name>
							<description>A readable, writable byte.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ACR</name>
					<description>Auto-baud Control Register. Contains controls for the auto-baud
						feature.</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Start bit. This bit is automatically cleared after
								auto-baud completion.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>START</name>
								<enumeratedValue>
									<name>STOPPED</name>
									<description>Auto-baud stop (auto-baud is not running).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STARTED</name>
									<description>Auto-baud start (auto-baud is running). Auto-baud
										run bit. This bit is automatically cleared after auto-baud
										completion.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Auto-baud mode select bit.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>MODE_0</name>
									<description>Mode 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE_1</name>
									<description>Mode 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTORESTART</name>
							<description>Restart bit.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>AUTORESTART</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No restart.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Restart in case of time-out (counter restarts at
										next UARTn Rx falling edge)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:3]</bitRange>

						</field>
						<field>
							<name>ABEOINTCLR</name>
							<description>End of auto-baud interrupt clear bit (write-only
								accessible). Writing a 1 will clear the corresponding interrupt in
								the UnIIR. Writing a 0 has no impact.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ABEOINTCLR</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>No impact.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear the corresponding interrupt in the IIR.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ABTOINTCLR</name>
							<description>Auto-baud time-out interrupt clear bit (write-only
								accessible). Writing a 1 will clear the corresponding interrupt in
								the UnIIR. Writing a 0 has no impact.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ABTOINTCLR</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>No impact.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear the corresponding interrupt in the IIR.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>Fractional Divider Register. Generates a clock input for the baud
						rate divider.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0x10</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIVADDVAL</name>
							<description>Baud-rate generation pre-scaler divisor value. If this
								field is 0, fractional baud-rate generator will not impact the UARTn
								baudrate.</description>
							<bitRange>[3:0]</bitRange>

						</field>
						<field>
							<name>MULVAL</name>
							<description>Baud-rate pre-scaler multiplier value. This field must be
								greater or equal 1 for UARTn to operate properly, regardless of
								whether the fractional baud-rate generator is used or not.</description>
							<bitRange>[7:4]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>

