SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>TER</name>
					<description>Transmit Enable Register. Turns off UART transmitter for use with
						software flow control.</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0x80</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:0]</bitRange>
						</field>
						<field>
							<name>TXEN</name>
							<description>When this bit is 1, as it is after a Reset, data written to
								the THR is output on the TXD pin as soon as any preceding data has
								been sent. If this bit is cleared to 0 while a character is being
								sent, the transmission of that character is completed, but no
								further characters are sent until this bit is set again. In other
								words, a 0 in this bit blocks the transfer of characters from the
								THR or TX FIFO into the transmit shift register. Software
								implementing software-handshaking can clear this bit when it
								receives an XOFF character (DC3). Software can set this bit again
								when it receives an XON (DC1) character.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RS485CTRL</name>
					<description>RS-485/EIA-485 Control. Contains controls to configure various
						aspects of RS-485/EIA-485 modes.</description>
					<addressOffset>0x04C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NMMEN</name>
							<description>NMM enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>NMMEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is
										enabled. In this mode, an address is detected when a
										received byte has the parity bit = 1, generating a received
										data interrupt. See Section 18.6.16 RS-485/EIA-485 modes of
										operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXDIS</name>
							<description>Receiver enable.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>RXDIS</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The receiver is enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The receiver is disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AADEN</name>
							<description>AAD enable.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>AADEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Auto Address Detect (AAD) is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Auto Address Detect (AAD) is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>DCTRL</name>
							<description>Direction control enable.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>DCTRL</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Auto Direction Control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Auto Direction Control.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OINV</name>
							<description>Direction control pin polarity. This bit reverses the
								polarity of the direction control signal on the Un_OE pin.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>OINV</name>
								<enumeratedValue>
									<name>DIRLOW</name>
									<description>The direction control pin will be driven to logic 0
										when the transmitter has data to be sent. It will be driven
										to logic 1 after the last bit of data has been transmitted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIRHIGH</name>
									<description>The direction control pin will be driven to logic 1
										when the transmitter has data to be sent. It will be driven
										to logic 0 after the last bit of data has been transmitted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>

