SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>RS485ADRMATCH</name>
					<description>RS-485/EIA-485 address match. Contains the address match value for
						RS-485/EIA-485 mode.</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADRMATCH</name>
							<description>Contains the address match value.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RS485DLY</name>
					<description>RS-485/EIA-485 direction control delay.</description>
					<addressOffset>0x054</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLY</name>
							<description>Contains the direction control (UnOE) delay value. This
								register works in conjunction with an 8-bit counter.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
			</registers>

		</peripheral>


		<peripheral>
			<name>UART1</name>
			<description>UART1 </description>
			<groupName>UART1</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1</name>
				<value>6</value>
			</interrupt>
			<registers>
				<register>
					<name>RBR</name>
					<description>DLAB =0 Receiver Buffer Register. Contains the next received
						character to be read.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>RBR</name>
							<description>The UART1 Receiver Buffer Register contains the oldest
								received byte in the UART1 RX FIFO.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>THR</name>
					<description>DLAB =0. Transmit Holding Register. The next character to be
						transmitted is written here.</description>
					<alternateRegister>RBR</alternateRegister>
					<addressOffset>0x000</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Writing to the UART1 Transmit Holding Register causes the
								data to be stored in the UART1 transmit FIFO. The byte will be sent
								when it reaches the bottom of the FIFO and the transmitter is
								available.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DLL</name>
					<description>DLAB =1. Divisor Latch LSB. Least significant byte of the baud rate
						divisor value. The full divisor is used to generate a baud rate from the
						fractional rate divider.</description>
					<alternateRegister>RBR</alternateRegister>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x01</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLLSB</name>
							<description>The UART1 Divisor Latch LSB Register, along with the U1DLM
								register, determines the baud rate of the UART1.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DLM</name>
					<description>DLAB =1. Divisor Latch MSB. Most significant byte of the baud rate
						divisor value. The full divisor is used to generate a baud rate from the
						fractional rate divider.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLMSB</name>
							<description>The UART1 Divisor Latch MSB Register, along with the U1DLL
								register, determines the baud rate of the UART1.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<description>DLAB =0. Interrupt Enable Register. Contains individual interrupt
						enable bits for the 7 potential UART1 interrupts.</description>
					<alternateRegister>DLM</alternateRegister>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RBRIE</name>
							<description>RBR Interrupt Enable. Enables the Receive Data Available
								interrupt for UART1. It also controls the Character Receive Time-out
								interrupt.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>RBRIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the RDA interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the RDA interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THREIE</name>
							<description>THRE Interrupt Enable. Enables the THRE interrupt for
								UART1. The status of this interrupt can be read from LSR[5].</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>THREIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the THRE interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the THRE interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIE</name>
							<description>RX Line Interrupt Enable. Enables the UART1 RX line status
								interrupts. The status of this interrupt can be read from LSR[4:1].</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>RXIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the RX line status interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the RX line status interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSIE</name>
							<description>Modem Status Interrupt Enable. Enables the modem interrupt.
								The status of this interrupt can be read from MSR[3:0].</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>MSIE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the modem interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the modem interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[6:4]</bitRange>

