SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>MCR</name>
					<description>Modem Control Register. Contains controls for flow control
						handshaking and loopback mode.</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DTRCTRL</name>
							<description>DTR Control. Source for modem output pin, DTR. This bit
								reads as 0 when modem loopback mode is active.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>RTSCTRL</name>
							<description>RTS Control. Source for modem output pin RTS. This bit
								reads as 0 when modem loopback mode is active.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[3:2]</bitRange>

						</field>
						<field>
							<name>LMS</name>
							<description>Loopback Mode Select. The modem loopback mode provides a
								mechanism to perform diagnostic loopback testing. Serial data from
								the transmitter is connected internally to serial input of the
								receiver. Input pin, RXD1, has no effect on loopback and output pin,
								TXD1 is held in marking state. The 4 modem inputs (CTS, DSR, RI and
								DCD) are disconnected externally. Externally, the modem outputs
								(RTS, DTR) are set inactive. Internally, the 4 modem outputs are
								connected to the 4 modem inputs. As a result of these connections,
								the upper 4 bits of the MSR will be driven by the lower 4 bits of
								the MCR rather than the 4 modem inputs in normal mode. This permits
								modem status interrupts to be generated in loopback mode by writing
								the lower 4 bits of MCR.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>LMS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable modem loopback mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable modem loopback mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>RTSEN</name>
							<description>RTS enable.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>RTSEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable auto-rts flow control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable auto-rts flow control.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTSEN</name>
							<description>CTS enable.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>CTSEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable auto-cts flow control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable auto-cts flow control.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>LSR</name>
					<description>Line Status Register. Contains flags for transmit and receive
						status, including line errors.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-only</access>
					<resetValue>0x60</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>RDR</name>
							<description>Receiver Data Ready. LSR[0] is set when the RBR holds an
								unread character and is cleared when the UART1 RBR FIFO is empty.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>RDR</name>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>The UART1 receiver FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNREAD</name>
									<description>The UART1 receiver FIFO is not empty.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OE</name>
							<description>Overrun Error. The overrun error condition is set as soon
								as it occurs. An LSR read clears LSR[1]. LSR[1] is set when UART1
								RSR has a new character assembled and the UART1 RBR FIFO is full. In
								this case, the UART1 RBR FIFO will not be overwritten and the
								character in the UART1 RSR will be lost.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>OE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Overrun error status is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Overrun error status is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PE</name>
							<description>Parity Error. When the parity bit of a received character
								is in the wrong state, a parity error occurs. An LSR read clears
								LSR[2]. Time of parity error detection is dependent on FCR[0]. Note:
								A parity error is associated with the character at the top of the
								UART1 RBR FIFO.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>PE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Parity error status is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Parity error status is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FE</name>
							<description>Framing Error. When the stop bit of a received character is
								a logic 0, a framing error occurs. An LSR read clears LSR[3]. The
								time of the framing error detection is dependent on FCR0. Upon
								detection of a framing error, the RX will attempt to resynchronize
								to the data and assume that the bad stop bit is actually an early
								start bit. However, it cannot be assumed that the next received byte
								will be correct even if there is no Framing Error. Note: A framing
								error is associated with the character at the top of the UART1 RBR
								FIFO.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>FE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Framing error status is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Framing error status is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BI</name>
							<description>Break Interrupt. When RXD1 is held in the spacing state
								(all zeroes) for one full character transmission (start, data,
								parity, stop), a break interrupt occurs. Once the break condition
								has been detected, the receiver goes idle until RXD1 goes to marking
								state (all ones). An LSR read clears this status bit. The time of
								break detection is dependent on FCR[0]. Note: The break interrupt is
								associated with the character at the top of the UART1 RBR FIFO.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>BI</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Break interrupt status is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Break interrupt status is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THRE</name>
							<description>Transmitter Holding Register Empty. THRE is set immediately
								upon detection of an empty UART1 THR and is cleared on a THR write.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>THRE</name>
								<enumeratedValue>
									<name>VALID_DATA</name>
									<description>THR contains valid data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>THR is empty.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TEMT</name>
							<description>Transmitter Empty. TEMT is set when both THR and TSR are
								empty; TEMT is cleared when either the TSR or the THR contain valid
								data.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>TEMT</name>
								<enumeratedValue>
									<name>VALID_DATA</name>
									<description>THR and/or the TSR contains valid data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>THR and the TSR are empty.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFE</name>
							<description>Error in RX FIFO. LSR[7] is set when a character with a RX
								error such as framing error, parity error or break interrupt, is
								loaded into the RBR. This bit is cleared when the LSR register is
								read and there are no subsequent errors in the UART1 FIFO.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>RXFE</name>
								<enumeratedValue>
									<name>NO_ERROR</name>
									<description>RBR contains no UART1 RX errors or FCR[0]=0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERRORS</name>
									<description>UART1 RBR contains at least one UART1 RX error.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>

