SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>RS485ADRMATCH</name>
					<description>RS-485/EIA-485 address match. Contains the address match value for
						RS-485/EIA-485 mode.</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADRMATCH</name>
							<description>Contains the address match value.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RS485DLY</name>
					<description>RS-485/EIA-485 direction control delay.</description>
					<addressOffset>0x054</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLY</name>
							<description>Contains the direction control (RTS or DTR) delay value.
								This register works in conjunction with an 8-bit counter.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral>
			<name>PWM0</name>
			<description>Pulse Width Modulators (PWM0/1) </description>
			<groupName>PWM</groupName>
			<baseAddress>0x40014000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PWM0</name>
				<value>39</value>
			</interrupt>
			<registers>
				<register>
					<name>IR</name>
					<description>Interrupt Register. The IR can be written to clear interrupts, or
						read to identify which PWM interrupt sources are pending.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWMMR0INT</name>
							<description>Interrupt flag for PWM match channel 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PWMMR1INT</name>
							<description>Interrupt flag for PWM match channel 1.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PWMMR2INT</name>
							<description>Interrupt flag for PWM match channel 2.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PWMMR3INT</name>
							<description>Interrupt flag for PWM match channel 3.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PWMCAP0INT</name>
							<description>Interrupt flag for capture input 0</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PWMCAP1INT</name>
							<description>Interrupt flag for capture input 1 (available in PWM1IR
								only; this bit is reserved in PWM0IR).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>PWMMR4INT</name>
							<description>Interrupt flag for PWM match channel 4.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>PWMMR5INT</name>
							<description>Interrupt flag for PWM match channel 5.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PWMMR6INT</name>
							<description>Interrupt flag for PWM match channel 6.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TCR</name>
					<description>Timer Control Register. The TCR is used to control the Timer
						Counter functions.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CE</name>
							<description>Counter Enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>CE</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The PWM Timer Counter and PWM Prescale Counter are
										enabled for counting.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The counters are disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CR</name>
							<description>Counter Reset</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>CR</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The PWM Timer Counter and the PWM Prescale Counter
										are synchronously reset on the next positive edge of PCLK.
										The counters remain reset until this bit is returned to
										zero.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Clear reset.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[2:2]</bitRange>

