SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MR%s</name>

					<description>Match Register. Match registers
						are continuously compared to the PWM counter in order to control PWM
						output edges.</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCH</name>
							<description>Timer counter match value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Capture Control Register. The CCR controls which edges of the
						capture inputs are used to load the Capture Registers and whether or not an
						interrupt is generated for a capture event.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP0_R</name>
							<description>Capture on PWMn_CAP0 rising edge</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>CAP0_R</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Rising edge. A synchronously sampled rising edge on
										PWMn_CAP0 will cause CR0 to be loaded with the contents of
										the TC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0_F</name>
							<description>Capture on PWMn_CAP0 falling edge</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>CAP0_F</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Falling edge. A synchronously sampled falling edge
										on PWMn_CAP0 will cause CR0 to be loaded with the contents
										of TC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0_I</name>
							<description>Interrupt on PWMn_CAP0 event</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>CAP0_I</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Interrupt. A CR0 load due to a PWMn_CAP0 event will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1_R</name>
							<description>Capture on PWMn_CAP1 rising edge. Reserved for PWM0.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>CAP1_R</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Rising edge. A synchronously sampled rising edge on
										PWMn_CAP1 will cause CR1 to be loaded with the contents of
										the TC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1_F</name>
							<description>Capture on PWMn_CAP1 falling edge. Reserved for PWM0.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>CAP1_F</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Falling edge. A synchronously sampled falling edge
										on PWMn_CAP1 will cause CR1 to be loaded with the contents
										of TC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1_I</name>
							<description>Interrupt on PWMn_CAP1 event. Reserved for PWM0.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>CAP1_I</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Interrupt. A CR1 load due to a PWMn_CAP1 event will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CR[%s]</name>
					<displayName>CR[%s]</displayName>
					<description>PWM Control Register. Enables PWM outputs and selects either single
						edge or double edge controlled PWM outputs.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[1:0]</bitRange>

