SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>PWMSEL2</name>
							<description>PWM[2] output single/double edge mode control.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>PWMSEL2</name>
								<enumeratedValue>
									<name>SINGLE_EDGE</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL3</name>
							<description>PWM[3] output edge control.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>PWMSEL3</name>
								<enumeratedValue>
									<name>SINGLE_EDGE</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL4</name>
							<description>PWM[4] output edge control.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>PWMSEL4</name>
								<enumeratedValue>
									<name>SINGLE_EDGE</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL5</name>
							<description>PWM[5] output edge control.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>PWMSEL5</name>
								<enumeratedValue>
									<name>SINGLE_EDGE</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL6</name>
							<description>PWM[6] output edge control.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>PWMSEL6</name>
								<enumeratedValue>
									<name>SINGLE_EDGE</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[8:7]</bitRange>

						</field>
						<field>
							<name>PWMENA1</name>
							<description>PWM[1] output enable control.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>PWMENA1</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA2</name>
							<description>PWM[2] output enable control.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>PWMENA2</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA3</name>
							<description>PWM[3] output enable control.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>PWMENA3</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA4</name>
							<description>PWM[4] output enable control.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>PWMENA4</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA5</name>
							<description>PWM[5] output enable control.</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>PWMENA5</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA6</name>
							<description>PWM[6] output enable control. See PWMENA1 for details.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>PWMENA6</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Unused, always zero.</description>
							<bitRange>[31:15]</bitRange>

