SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>


				<register>
					<name>LER</name>
					<description>Load Enable Register. Enables use of updated PWM match values.</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MAT0LATCHEN</name>
							<description>Enable PWM Match 0 Latch. PWM MR0 register update control.
								Writing a one to this bit allows the last value written to the PWM
								Match Register 0 to be become effective when the timer is next reset
								by a PWM Match event. See Section 27.6.7.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MAT1LATCHEN</name>
							<description>Enable PWM Match 1 Latch. PWM MR1 register update control.
								See bit 0 for details.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>MAT2LATCHEN</name>
							<description>Enable PWM Match 2 Latch. PWM MR2 register update control.
								See bit 0 for details.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>MAT3LATCHEN</name>
							<description>Enable PWM Match 3 Latch. PWM MR3 register update control.
								See bit 0 for details.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>MAT4LATCHEN</name>
							<description>Enable PWM Match 4 Latch. PWM MR4 register update control.
								See bit 0 for details.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>MAT5LATCHEN</name>
							<description>Enable PWM Match 5 Latch. PWM MR5 register update control.
								See bit 0 for details.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>MAT6LATCHEN</name>
							<description>Enable PWM Match 6 Latch. PWM MR6 register update control.
								See bit 0 for details.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTCR</name>
					<description>Count Control Register. The CTCR selects between Timer and Counter
						mode, and in Counter mode selects the signal and edge(s) for counting.</description>
					<addressOffset>0x070</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MOD</name>
							<description>Counter/ Timer Mode</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>MOD</name>
								<enumeratedValue>
									<name>TIMER</name>
									<description>Timer Mode: the TC is incremented when the Prescale
										Counter matches the Prescale register.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_RISING</name>
									<description>Rising edge counter Mode: the TC is incremented on
										rising edges of the PWM_CAP input selected by bits 3:2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_FALLING</name>
									<description>Falling edge counter Mode: the TC is incremented on
										falling edges of the PWM_CAP input selected by bits 3:2.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_DUAL</name>
									<description>Dual edge counter Mode: the TC is incremented on
										both edges of the PWM_CAP input selected by bits 3:2.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIS</name>
							<description>Count Input Select. When bits 1:0 are not 00, these bits
								select which PWM_CAP pin carries the signal used to increment the
								TC. Other combinations are reserved.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>CIS</name>
								<enumeratedValue>
									<name>CAP0</name>
									<description>For PWM0: 00 = PWM0_CAP0 (Other combinations are
										reserved) For PWM1: 00 = PWM1_CAP0, 01 = PWM1_CAP1 (Other
										combinations are reserved)</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>

						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral derivedFrom="PWM0">
			<name>PWM1</name>
			<baseAddress>0x40018000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PWM1</name>
				<value>9</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>I2C0</name>
			<description>I2C bus interface</description>
			<groupName>I2C</groupName>
			<baseAddress>0x4001C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C0</name>
				<value>10</value>

			</interrupt>
			<registers>
				<register>
					<name>CONSET</name>
					<description>I2C Control Set Register. When a one is written to a bit of this
						register, the corresponding bit in the I2C control register is set. Writing
						a zero has no effect on the corresponding bit in the I2C control register.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>AA</name>
							<description>Assert acknowledge flag.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SI</name>
							<description>I2C interrupt flag.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>STO</name>
							<description>STOP flag.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>STA</name>
							<description>START flag.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>I2EN</name>
							<description>I2C interface enable.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>I2C Status Register. During I2C operation, this register provides
						detailed status codes that allow software to determine the next action
						needed.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0xF8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>These bits are unused and are always 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>Status</name>
							<description>These bits give the actual status information about the I
								2C interface.</description>
							<bitRange>[7:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DAT</name>
					<description>I2C Data Register. During master or slave transmit mode, data to be
						transmitted is written to this register. During master or slave receive
						mode, data that has been received may be read from this register.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Data</name>
							<description>This register holds data values that have been received or
								are to be transmitted.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADR0</name>
					<description>I2C Slave Address Register 0. Contains the 7-bit slave address for
						operation of the I2C interface in slave mode, and is not used in master
						mode. The least significant bit determines whether a slave responds to the
						General Call address.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GC</name>
							<description>General Call enable bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>Address</name>
							<description>The I2C device address for slave mode.</description>
							<bitRange>[7:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SCLH</name>
					<description>SCH Duty Cycle Register High Half Word. Determines the high time of
						the I2C clock.</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0x04</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCLH</name>
							<description>Count for SCL HIGH time period selection.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SCLL</name>
					<description>SCL Duty Cycle Register Low Half Word. Determines the low time of
						the I2C clock. SCLL and SCLH together determine the clock frequency
						generated by an I2C master and certain times used in slave mode.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0x04</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCLL</name>
							<description>Count for SCL low time period selection.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CONCLR</name>
					<description>I2C Control Clear Register. When a one is written to a bit of this
						register, the corresponding bit in the I2C control register is cleared.
						Writing a zero has no effect on the corresponding bit in the I2C control
						register.</description>
					<addressOffset>0x018</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>AAC</name>
							<description>Assert acknowledge Clear bit.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SIC</name>
							<description>I2C interrupt Clear bit.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>STAC</name>
							<description>START flag Clear bit.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>I2ENC</name>
							<description>I2C interface Disable bit.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MMCTRL</name>
					<description>Monitor mode control register.</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MM_ENA</name>
							<description>Monitor mode enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>MM_ENA</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Monitor mode disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The I2C module will enter monitor mode. In this
										mode the SDA output will be forced high. This will prevent
										the I2C module from outputting data of any kind (including
										ACK) onto the I2C data bus. Depending on the state of the
										ENA_SCL bit, the output may be also forced high, preventing
										the module from having control over the I2C clock line.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENA_SCL</name>
							<description>SCL output enable.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENA_SCL</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>When this bit is cleared to 0, the SCL output will
										be forced high when the module is in monitor mode. As
										described above, this will prevent the module from having
										any control over the I2C clock line.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>When this bit is set, the I2C module may exercise
										the same control over the clock line that it would in normal
										operation. This means that, acting as a slave peripheral,
										the I2C module can stretch the clock line (hold it low)
										until it has had time to respond to an I2C interrupt.[1]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MATCH_ALL</name>
							<description>Select interrupt register match.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>MATCH_ALL</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>When this bit is cleared, an interrupt will only be
										generated when a match occurs to one of the (up-to) four
										address registers described above. That is, the module will
										respond as a normal slave as far as address-recognition is
										concerned.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>When this bit is set to 1 and the I2C is in monitor
										mode, an interrupt will be generated on ANY address
										received. This will enable the part to monitor all traffic
										on the bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from reserved bits is not defined.</description>
							<bitRange>[31:3]</bitRange>

