SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>1-3</dimIndex>
					<name>ADR%s</name>
					<description>I2C Slave Address Register. Contains the 7-bit slave address for
						operation of the I2C interface in slave mode, and is not used in master
						mode. The least significant bit determines whether a slave responds to the
						General Call address.</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GC</name>
							<description>General Call enable bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>Address</name>
							<description>The I2C device address for slave mode.</description>
							<bitRange>[7:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA_BUFFER</name>
					<description>Data buffer register. The contents of the 8 MSBs of the DAT shift
						register will be transferred to the DATA_BUFFER automatically after every
						nine bits (8 bits of data plus ACK or NACK) has been received on the bus.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Data</name>
							<description>This register holds contents of the 8 MSBs of the DAT shift
								register.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MASK[%s]</name>
					<displayName>MASK[%s]</displayName>
					<description>I2C Slave address mask register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved
								bits. This bit reads always back as 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MASK</name>
							<description>Mask bits.</description>
							<bitRange>[7:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>RTC</name>
			<description> Real Time Clock (RTC) </description>
			<groupName>RTC</groupName>
			<baseAddress>0x40024000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC</name>
				<value>17</value>
			</interrupt>
			<registers>
				<register>
					<name>ILR</name>
					<description>Interrupt Location Register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RTCCIF</name>
							<description>When one, the Counter Increment Interrupt block generated
								an interrupt. Writing a one to this bit location clears the counter
								increment interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RTCALF</name>
							<description>When one, the alarm registers generated an interrupt.
								Writing a one to this bit location clears the alarm interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Clock Control Register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLKEN</name>
							<description>Clock Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>CLKEN</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The time counters are enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The time counters are disabled so that they may be
										initialized.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTCRST</name>
							<description>CTC Reset.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>CTCRST</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>When one, the elements in the internal oscillator
										divider are reset, and remain reset until CCR[1] is changed
										to zero. This is the divider that generates the 1 Hz clock
										from the 32.768 kHz crystal. The state of the divider is not
										visible to software.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_EFFECT_</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Internal test mode controls. These bits must be 0 for
								normal RTC operation.</description>
							<bitRange>[3:2]</bitRange>

