SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>CALDIR</name>
							<description>Calibration direction</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>CALDIR</name>
								<enumeratedValue>
									<name>BACKWARD</name>
									<description>Backward calibration. When CALVAL is equal to the
										calibration counter, the RTC timers will stop incrementing
										for 1 second.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORWARD</name>
									<description>Forward calibration. When CALVAL is equal to the
										calibration counter, the RTC timers will jump by 2 seconds.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>5</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-4</dimIndex>
					<name>GPREG%s</name>
					<description>General Purpose Register 0</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>GP</name>
							<description>General purpose storage.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_AUX</name>
					<description>RTC Auxiliary control register</description>
					<addressOffset>0x05C</addressOffset>
					<access>read-write</access>
					<resetValue>0x10</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RTC_OSCF</name>
							<description>RTC Oscillator Fail detect flag. Read: this bit is set if
								the RTC oscillator stops, and when RTC power is first turned on. An
								interrupt will occur when this bit is set, the RTC_OSCFEN bit in
								RTC_AUXEN is a 1, and the RTC interrupt is enabled in the NVIC.
								Write: writing a 1 to this bit clears the flag.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RTC_PDOUT</name>
							<description>When 0: the RTC_ALARM pin reflects the RTC alarm status.
								When 1: the RTC_ALARM pin indicates Deep Power-down mode.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_AUXEN</name>
					<description>RTC Auxiliary Enable register</description>
					<addressOffset>0x058</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RTC_OSCFEN</name>
							<description>Oscillator Fail Detect interrupt enable. When 0: the RTC
								Oscillator Fail detect interrupt is disabled. When 1: the RTC
								Oscillator Fail detect interrupt is enabled. See Section 30.6.2.5.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ASEC</name>
					<description>Alarm value for Seconds</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SECONDS</name>
							<description>Seconds value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AMIN</name>
					<description>Alarm value for Minutes</description>
					<addressOffset>0x64</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MINUTES</name>
							<description>Minutes value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AHRS</name>
					<description>Alarm value for Hours</description>
					<addressOffset>0x068</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>HOURS</name>
							<description>Hours value in the range of 0 to 23</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOM</name>
					<description>Alarm value for Day of Month</description>
					<addressOffset>0x06C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOM</name>
							<description>Day of month value in the range of 1 to 28, 29, 30, or 31
								(depending on the month and whether it is a leap year).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOW</name>
					<description>Alarm value for Day of Week</description>
					<addressOffset>0x070</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOW</name>
							<description>Day of week value in the range of 0 to 6.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOY</name>
					<description>Alarm value for Day of Year</description>
					<addressOffset>0x074</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOY</name>
							<description>Day of year value in the range of 1 to 365 (366 for leap
								years).</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AMON</name>
					<description>Alarm value for Months</description>
					<addressOffset>0x078</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MONTH</name>
							<description>Month value in the range of 1 to 12.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AYRS</name>
					<description>Alarm value for Year</description>
					<addressOffset>0x07C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>YEAR</name>
							<description>Year value in the range of 0 to 4095.</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ERCONTROL</name>
					<description>Event Monitor/Recorder Control register. Contains bits that control
						actions for the event channels as well as for Event Monitor/Recorder setup.</description>
					<addressOffset>0x084</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTWAKE_EN0</name>
							<description>Interrupt and wakeup enable for channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>INTWAKE_EN0</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No interrupt or wakeup will be generated by event
										channel 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>An event in channel 0 will trigger an (RTC)
										interrupt and a wake-up request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPCLEAR_EN0</name>
							<description>Enables automatically clearing the RTC general purpose
								registers when an event occurs on channel 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>GPCLEAR_EN0</name>
								<enumeratedValue>
									<name>NOGPREG</name>
									<description>Channel 0 has no influence on the general purpose
										registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLRGPREG</name>
									<description>An event in channel 0 will clear the general
										purpose registers asynchronously.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POL0</name>
							<description>Selects the polarity of an event on input pin RTC_EV0.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>POL0</name>
								<enumeratedValue>
									<name>NEG</name>
									<description>A channel 0 event is defined as a negative edge on
										RTC_EV0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POS</name>
									<description>A channel 0 event is defined as a positive edge on
										RTC_EV0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV0_INPUT_EN</name>
							<description>Event enable control for channel 0.[1]</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>EV0_INPUT_EN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Event 0 input is disabled and forced high
										internally.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Event 0 input is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[9:4]</bitRange>

