SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>INTWAKE_EN1</name>
							<description>Interrupt and wakeup enable for channel 1.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>INTWAKE_EN1</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No interrupt or wakeup will be generated by event
										channel 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKEUP</name>
									<description>An event in channel 1 will trigger an (RTC)
										interrupt and a wake-up request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPCLEAR_EN1</name>
							<description>Enables automatically clearing the RTC general purpose
								registers when an event occurs on channel 1.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>GPCLEAR_EN1</name>
								<enumeratedValue>
									<name>NOGPREG</name>
									<description>Channel 1 has no influence on the general purpose
										registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLRGPREG</name>
									<description>A n event in channel 1 will clear the general
										purpose registers asynchronously.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POL1</name>
							<description>Selects the polarity of an event on input pin RTC_EV1.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>POL1</name>
								<enumeratedValue>
									<name>NEG</name>
									<description>A channel 1 event is defined as a negative edge on
										RTC_EV1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POS</name>
									<description>A channel 1 event is defined as a positive edge on
										RTC_EV1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV1_INPUT_EN</name>
							<description>Event enable control for channel 1.[1]</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>EV1_INPUT_EN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Event 1 input is disabled and forced high
										internally.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Event 1 input is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[19:14]</bitRange>

						</field>
						<field>
							<name>INTWAKE_EN2</name>
							<description>Interrupt and wakeup enable for channel 2.</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>INTWAKE_EN2</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No interrupt or wakeup will be generated by event
										channel 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKEUP</name>
									<description>An event in channel 2 will trigger an (RTC)
										interrupt and a wake-up request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPCLEAR_EN2</name>
							<description>Enables automatically clearing the RTC general purpose
								registers when an event occurs on channel 2.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>GPCLEAR_EN2</name>
								<enumeratedValue>
									<name>NOGPREG</name>
									<description>Channel 2 has no influence on the general purpose
										registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLRGPREG</name>
									<description>An event in channel 2 will clear the general
										purpose registers asynchronously.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POL2</name>
							<description>Selects the polarity of an event on input pin RTC_EV2.</description>
							<bitRange>[22:22]</bitRange>
							<enumeratedValues>
								<name>POL2</name>
								<enumeratedValue>
									<name>NEG</name>
									<description>A channel 2 event is defined as a negative edge on
										RTC_EV2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POS</name>
									<description>A channel 2 event is defined as a positive edge on
										RTC_EV2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV2_INPUT_EN</name>
							<description>Event enable control for channel 2.[1]</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>EV2_INPUT_EN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Event 2 input is disabled and forced high
										internally.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Event 2 input is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[29:24]</bitRange>

