SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<name>ENF0</name>
					<description>GPIO Interrupt Enable for Falling edge for Port 0.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0_0EF</name>
							<description>Enable falling edge interrupt for P0[0]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>P0_1EF</name>
							<description>Enable falling edge interrupt for P0[1]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>P0_2EF</name>
							<description>Enable falling edge interrupt for P0[2]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>P0_3EF</name>
							<description>Enable falling edge interrupt for P0[3]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>P0_4EF</name>
							<description>Enable falling edge interrupt for P0[4]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>P0_5EF</name>
							<description>Enable falling edge interrupt for P0[5]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>P0_6EF</name>
							<description>Enable falling edge interrupt for P0[6]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>P0_7EF</name>
							<description>Enable falling edge interrupt for P0[7]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>P0_8EF</name>
							<description>Enable falling edge interrupt for P0[8]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>P0_9EF</name>
							<description>Enable falling edge interrupt for P0[9]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>P0_10EF</name>
							<description>Enable falling edge interrupt for P0[10]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>P0_11EF</name>
							<description>Enable falling edge interrupt for P0[11]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>P0_12EF</name>
							<description>Enable falling edge interrupt for P0[12]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>P0_13EF</name>
							<description>Enable falling edge interrupt for P0[13]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>P0_14EF</name>
							<description>Enable falling edge interrupt for P0[14]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>P0_15EF</name>
							<description>Enable falling edge interrupt for P0[15]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>P0_16EF</name>
							<description>Enable falling edge interrupt for P0[16]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>P0_17EF</name>
							<description>Enable falling edge interrupt for P0[17]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>P0_18EF</name>
							<description>Enable falling edge interrupt for P0[18]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>P0_19EF</name>
							<description>Enable falling edge interrupt for P0[19]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>P0_20EF</name>
							<description>Enable falling edge interrupt for P0[20]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>P0_21EF</name>
							<description>Enable falling edge interrupt for P0[21]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>P0_22EF</name>
							<description>Enable falling edge interrupt for P0[22]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>P0_23EF</name>
							<description>Enable falling edge interrupt for P0[23]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>P0_24EF</name>
							<description>Enable falling edge interrupt for P0[24]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>P0_25EF</name>
							<description>Enable falling edge interrupt for P0[25]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>P0_26EF</name>
							<description>Enable falling edge interrupt for P0[26]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>P0_27EF</name>
							<description>Enable falling edge interrupt for P0[27]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>P0_28EF</name>
							<description>Enable falling edge interrupt for P0[28]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>P0_29EF</name>
							<description>Enable falling edge interrupt for P0[29]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>P0_30EF</name>
							<description>Enable falling edge interrupt for P0[30]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>P0_31EF</name>
							<description>Enable falling edge interrupt for P0[31]. 0 = Disable
								falling edge interrupt. 1 = Enable falling edge interrupt.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATR2</name>
					<description>GPIO Interrupt Status for Rising edge for Port 0.</description>
					<addressOffset>0x024</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P2_0REI</name>
							<description>Status of Rising Edge Interrupt for P2[0]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>P2_1REI</name>
							<description>Status of Rising Edge Interrupt for P2[1]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>P2_2REI</name>
							<description>Status of Rising Edge Interrupt for P2[2]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>P2_3REI</name>
							<description>Status of Rising Edge Interrupt for P2[3]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>P2_4REI</name>
							<description>Status of Rising Edge Interrupt for P2[4]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>P2_5REI</name>
							<description>Status of Rising Edge Interrupt for P2[5]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>P2_6REI</name>
							<description>Status of Rising Edge Interrupt for P2[6]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>P2_7REI</name>
							<description>Status of Rising Edge Interrupt for P2[7]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>P2_8REI</name>
							<description>Status of Rising Edge Interrupt for P2[8]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>P2_9REI</name>
							<description>Status of Rising Edge Interrupt for P2[9]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>P2_10REI</name>
							<description>Status of Rising Edge Interrupt for P2[10]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>P2_11REI</name>
							<description>Status of Rising Edge Interrupt for P2[11]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>P2_12REI</name>
							<description>Status of Rising Edge Interrupt for P2[12]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>P2_13REI</name>
							<description>Status of Rising Edge Interrupt for P2[13]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>P2_14REI</name>
							<description>Status of Rising Edge Interrupt for P2[14]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>P2_15REI</name>
							<description>Status of Rising Edge Interrupt for P2[15]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>P2_16REI</name>
							<description>Status of Rising Edge Interrupt for P2[16]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>P2_17REI</name>
							<description>Status of Rising Edge Interrupt for P2[17]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>P2_18REI</name>
							<description>Status of Rising Edge Interrupt for P2[18]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>P2_19REI</name>
							<description>Status of Rising Edge Interrupt for P2[19]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>P2_20REI</name>
							<description>Status of Rising Edge Interrupt for P2[20]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>P2_21REI</name>
							<description>Status of Rising Edge Interrupt for P2[21]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>P2_22REI</name>
							<description>Status of Rising Edge Interrupt for P2[22]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>P2_23REI</name>
							<description>Status of Rising Edge Interrupt for P2[23]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>P2_24REI</name>
							<description>Status of Rising Edge Interrupt for P2[24]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>P2_25REI</name>
							<description>Status of Rising Edge Interrupt for P2[25]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>P2_26REI</name>
							<description>Status of Rising Edge Interrupt for P2[26]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>P2_27REI</name>
							<description>Status of Rising Edge Interrupt for P2[27]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>P2_28REI</name>
							<description>Status of Rising Edge Interrupt for P2[28]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>P2_29REI</name>
							<description>Status of Rising Edge Interrupt for P2[29]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>P2_30REI</name>
							<description>Status of Rising Edge Interrupt for P2[30]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>P2_31REI</name>
							<description>Status of Rising Edge Interrupt for P2[31]. 0 = No rising
								edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
