SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<name>P0_8</name>
					<description>I/O configuration register for pin P0[8] </description>
					<addressOffset>0x20</addressOffset>
					<access>read-write</access>
					<resetValue>0x000000A0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[8] </description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_8</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2S_TX_WS</name>
									<description>I2S Transmit word select. It is driven by the
										master and received by the slave. Corresponds to the signal
										WS in the I2S-bus specification.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP1_MISO</name>
									<description>Master In Slave Out for SSP1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2_MAT2</name>
									<description>Match output for Timer 2, channel 2.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC_EV1</name>
									<description>Event input 1 to Event Monitor/Recorder.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_16</name>
									<description>LCD data.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>FILTER</name>
							<description>Glitch filter control</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>FILTER</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Noise pulses below approximately 10 ns are filtered
										out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No input filtering is done.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_9</name>
					<description>I/O configuration register for pin P0[9]</description>
					<addressOffset>0x24</addressOffset>
					<access>read-write</access>
					<resetValue>0x000000A0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[9]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_9</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2S_TX_SDA</name>
									<description>I2S transmit data. It is driven by the transmitter
										and read by the receiver. Corresponds to the signal SD in
										the I2S-bus specification.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP1_MOSI</name>
									<description>Master Out Slave In for SSP1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2_MAT3</name>
									<description>Match output for Timer 2, channel 3.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC_EV2</name>
									<description>Event input 2 to Event Monitor/Recorder.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_17</name>
									<description>LCD data.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>FILTER</name>
							<description>Glitch filter control</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>FILTER</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Noise pulses below approximately 10 ns are filtered
										out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No input filtering is done.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_10</name>
					<description>I/O configuration register for pin P0[10]</description>
					<addressOffset>0x28</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[10]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_10</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U2_TXD</name>
									<description>Transmitter output for UART2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C2_SDA</name>
									<description>I2C2 data input/output (this pin does not use a
										specialized I2C pad).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_MAT0</name>
									<description>Match output for Timer 3, channel 0.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_11</name>
					<description>I/O configuration register for pin P0[11]</description>
					<addressOffset>0x2C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[11]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_11</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U2_RXD</name>
									<description>Receiver input for UART2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C2_SCL</name>
									<description>I2C2 clock input/output (this pin does not use a
										specialized I2C pad).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_MAT1</name>
									<description>Match output for Timer 3, channel 1.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
