SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<name>P0_22</name>
					<description>I/O configuration register for pin P0[22]</description>
					<addressOffset>0x58</addressOffset>
					<access>read-write</access>
					<resetValue>0x000001B0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[22]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_22</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U1_RTS</name>
									<description>Request to Send output for UART1. Can also be
										configured to be an RS-485/EIA-485 output enable signal for
										UART1.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SD_DAT_0</name>
									<description>Data line 0 for SD card interface.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U4_TXD</name>
									<description>Transmitter output for USART4 (input/output in
										smart card mode).</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN_TD1</name>
									<description>CAN1 transmitter output.</description>
									<value>0x4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADMODE</name>
							<description>Selects Analog/Digital mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ADMODE</name>
								<enumeratedValue>
									<name>ANALOG</name>
									<description>Analog input mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL</name>
									<description>Digital functional mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILTR</name>
							<description>Selects 10 ns input glitch filter.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>FILTR</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Filter disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Filter enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain
										mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_23</name>
					<description>I/O configuration register for pin P0[23]</description>
					<addressOffset>0x5C</addressOffset>
					<access>read-write</access>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[23]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_23</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0_IN_0</name>
									<description>A/D converter 0, input 0. When configured as an ADC
										input, the digital function of the pin must be disabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2S_RX_SCK</name>
									<description>Receive Clock. It is driven by the master and
										received by the slave. Corresponds to the signal SCK in the
										I2S-bus specification.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_CAP0</name>
									<description>Capture input for Timer 3, channel 0.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_24</name>
					<description>I/O configuration register for pin P0[24]</description>
					<addressOffset>0x60</addressOffset>
					<access>read-write</access>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[24]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_24</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0_IN_1</name>
									<description>A/D converter 0, input 1. When configured as an ADC
										input, the digital function of the pin must be disabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2S_RX_WS</name>
									<description>Receive Word Select. It is driven by the master and
										received by the slave. Corresponds to the signal WS in the
										I2S-bus specification.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_CAP1</name>
									<description>Capture input for Timer 3, channel 1.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_25</name>
					<description>I/O configuration register for pin P0[25]</description>
					<addressOffset>0x64</addressOffset>
					<access>read-write</access>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[25]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_25</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0_IN_2</name>
									<description>A/D converter 0, input 2. When configured as an ADC
										input, the digital function of the pin must be disabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2S_RX_SDA</name>
									<description>Receive data. It is driven by the transmitter and
										read by the receiver. Corresponds to the signal SD in the
										I2S-bus specification.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U3_TXD</name>
									<description>Transmitter output for UART3.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_26</name>
					<description>I/O configuration register for pin P0[26]</description>
					<addressOffset>0x68</addressOffset>
					<access>read-write</access>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[26]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_26</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0_IN_3</name>
									<description>A/D converter 0, input 3. When configured as an ADC
										input, the digital function of the pin must be disabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DAC_OUT</name>
									<description>D/A converter output. When configured as the DAC
										output, the digital function of the pin must be disabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U3_RXD</name>
									<description>Receiver input for UART3.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADMODE</name>
							<description>Selects Analog/Digital mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ADMODE</name>
								<enumeratedValue>
									<name>ANALOG</name>
									<description>Analog input mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL</name>
									<description>Digital functional mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILTR</name>
							<description>Selects 10 ns input glitch filter.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>FILTR</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Filter disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Filter enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain
										mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:11]</bitRange>
						</field>
						<field>
							<name>DACEN</name>
							<description>DAC output enable.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>DACEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>DAC disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>DAC enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:17]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_27</name>
					<description>I/O configuration register for pin P0[27]</description>
					<addressOffset>0x6C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P0[27]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P0_27</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_SDA</name>
									<description>I2C0 data input/output. (This pin uses a
										specialized I2C pad).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_SDA1</name>
									<description>I2C serial data for communication with an external
										USB transceiver.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[5:3]</bitRange>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>HS</name>
							<description>Configures I2C features for standard mode, fast mode, and
								Fast Mode
								Plus operation.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>HS</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>I2C 50ns glitch filter and slew rate control
										enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>I2C 50ns glitch filter and slew rate control
										disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HIDRIVE</name>
							<description>Controls sink current capability of the pin, only for P5[2]
								and
								P5[3].</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>HIDRIVE</name>
								<enumeratedValue>
									<name>LOWDRIVE</name>
									<description>Output drive sink is 4 mA. This is sufficient for
										standard
										and fast mode I2C.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHDRIVE</name>
									<description>Output drive sink is 20 mA. This is needed for Fast
										Mode
										Plus I2C. Refer to the appropriate specific device data
										sheet for
										details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
