SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<name>P1_11</name>
					<description>I/O configuration register for pin P1[11]</description>
					<addressOffset>0xAC</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[11]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_11</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_RXD2</name>
									<description>Ethernet Receive Data 2 (MII interface).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SD_DAT_2</name>
									<description>Data line 2 for SD card interface.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM0_6</name>
									<description>Pulse Width Modulator 0, output 6.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_12</name>
					<description>I/O configuration register for pin P1[12]</description>
					<addressOffset>0xB0</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[12]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_12</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_RXD3</name>
									<description>Ethernet Receive Data (MII interface).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SD_DAT_3</name>
									<description>Data line 3 for SD card interface.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM0_CAP0</name>
									<description>Capture input for PWM0, channel 0.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_13</name>
					<description>I/O configuration register for pin P1[13]</description>
					<addressOffset>0xB4</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[13]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_13</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_RX_DV</name>
									<description>Ethernet Receive Data Valid (MII interface).</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_14</name>
					<description>I/O configuration register for pin P1[14]</description>
					<addressOffset>0xB8</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[14]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_14</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_RX_ER</name>
									<description>Ethernet receive error (RMII/MII interface).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2_CAP0</name>
									<description>Capture input for Timer 2, channel 0.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
