SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<name>P1_19</name>
					<description>I/O configuration register for pin P1[19]</description>
					<addressOffset>0xCC</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[19]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_19</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_TX_E1</name>
									<description>Transmit Enable signal for USB port 1 (OTG
										transceiver).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_PPWR1</name>
									<description>Port Power enable signal for USB port 1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T1_CAP1</name>
									<description>Capture input for Timer 1, channel 1.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MC_0A</name>
									<description>Motor control PWM channel 0, output A.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP1_SCK</name>
									<description>Serial clock for SSP1.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U2_OE</name>
									<description>RS-485/EIA-485 output enable signal for UART2.</description>
									<value>0x6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_20</name>
					<description>I/O configuration register for pin P1[20]</description>
					<addressOffset>0xD0</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[20]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_20</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_TX_DP1</name>
									<description>D+ transmit data for USB port 1 (OTG transceiver).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1_2</name>
									<description>Pulse Width Modulator 1, channel 2 output.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QEI_PHA</name>
									<description>Quadrature Encoder Interface PHA input.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MC_FB0</name>
									<description>Motor control PWM channel 0 feedback input.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP0_SCK</name>
									<description>Serial clock for SSP0.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_6</name>
									<description>LCD data.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_10</name>
									<description>LCD data.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_21</name>
					<description>I/O configuration register for pin P1[21]</description>
					<addressOffset>0xD4</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[21]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_21</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_TX_DM1</name>
									<description>D- transmit data for USB port 1 (OTG transceiver).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1_3</name>
									<description>Pulse Width Modulator 1, channel 3 output.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP0_SSEL</name>
									<description>Slave Select for SSP0.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MC_ABORT</name>
									<description>Motor control PWM, active low fast abort.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_7</name>
									<description>LCD data.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_11</name>
									<description>LCD data.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_22</name>
					<description>I/O configuration register for pin P1[22]</description>
					<addressOffset>0xD8</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[22]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_22</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_RCV1</name>
									<description>Differential receive data for USB port 1 (OTG
										transceiver).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_PWRD1</name>
									<description>Power Status for USB port 1 (host power switch).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T1_MAT0</name>
									<description>Match output for Timer 1, channel 0.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MC_0B</name>
									<description>Motor control PWM channel 0, output B.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP1_MOSI</name>
									<description>Master Out Slave In for SSP1.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_8</name>
									<description>LCD data.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_12</name>
									<description>LCD data.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
