SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<name>P1_23</name>
					<description>I/O configuration register for pin P1[23]</description>
					<addressOffset>0xDC</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[23]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_23</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_RX_DP1</name>
									<description>D+ receive data for USB port 1 (OTG transceiver).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1_4</name>
									<description>Pulse Width Modulator 1, channel 4 output.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QEI_PHB</name>
									<description>Quadrature Encoder Interface PHB input.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MC_FB1</name>
									<description>Motor control PWM channel 1 feedback input.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP0_MISO</name>
									<description>Master In Slave Out for SSP0.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_9</name>
									<description>LCD data.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_13</name>
									<description>LCD data.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_24</name>
					<description>I/O configuration register for pin P1[24]</description>
					<addressOffset>0xE0</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[24]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_24</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_RX_DM1</name>
									<description>D- receive data for USB port 1 (OTG transceiver).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1_5</name>
									<description>Pulse Width Modulator 1, channel 5 output.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QEI_IDX</name>
									<description>Quadrature Encoder Interface INDEX input.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MC_FB2</name>
									<description>Motor control PWM channel 2 feedback input.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP0_MOSI</name>
									<description>Master Out Slave in for SSP0.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_10</name>
									<description>LCD data.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_14</name>
									<description>LCD data.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_25</name>
					<description>I/O configuration register for pin P1[25]</description>
					<addressOffset>0xE4</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[25]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_25</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_LS1</name>
									<description>Low Speed status for USB port 1 (OTG transceiver).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_HSTEN1</name>
									<description>Host Enabled status for USB port 1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T1_MAT1</name>
									<description>Match output for Timer 1, channel 1.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MC_1A</name>
									<description>Motor control PWM channel 1, output A.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKOUT</name>
									<description>Selectable clock output.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_11</name>
									<description>LCD data.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_VD_15</name>
									<description>LCD data.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
