SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<name>P1_30</name>
					<description>I/O configuration register for pin P1[30]</description>
					<addressOffset>0xF8</addressOffset>
					<access>read-write</access>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[30]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_30</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_PWRD2</name>
									<description>Power Status for USB port 2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_VBUS</name>
									<description>Monitors the presence of USB bus power.This signal
										must be HIGH for USB reset to occur.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0_IN_4</name>
									<description>A/D converter 0, input 4. When configured as an ADC
										input, the digital function of the pin must be disabled.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_SDA</name>
									<description>I2C0 data input/output (this pin does not use a
										specialized I2C pad.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U3_OE</name>
									<description>RS-485/EIA-485 output enable signal for UART3.</description>
									<value>0x5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_31</name>
					<description>I/O configuration register for pin P1[31]</description>
					<addressOffset>0xFC</addressOffset>
					<access>read-write</access>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P1[31]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P1_31</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_OVRCR2</name>
									<description>Over-Current status for USB port 2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSP1_SCK</name>
									<description>Serial Clock for SSP1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0_IN_5</name>
									<description>A/D converter 0, input 5. When configured as an ADC
										input, the digital function of the pin must be disabled.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_SCL</name>
									<description>I2C0 clock input/output (this pin does not use a
										specialized I2C pad.</description>
									<value>0x4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_0</name>
					<description>I/O configuration register for pin P2[0]</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P2[0]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P2_0</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1_1</name>
									<description>Pulse Width Modulator 1, channel 1 output.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U1_TXD</name>
									<description>Transmitter output for UART1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_PWR</name>
									<description>LCD panel power enable.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_1</name>
					<description>I/O configuration register for pin P2[1]</description>
					<addressOffset>0x104</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P2[1]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P2_1</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1_2</name>
									<description>Pulse Width Modulator 1, channel 2 output.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U1_RXD</name>
									<description>Receiver input for UART1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_LE</name>
									<description>Line end signal.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_2</name>
					<description>I/O configuration register for pin P2[2]</description>
					<addressOffset>0x108</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P2[2]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P2_2</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1_3</name>
									<description>Pulse Width Modulator 1, channel 3 output.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U1_CTS</name>
									<description>Clear to Send input for UART1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2_MAT3</name>
									<description>Match output for Timer 2, channel 3.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRACEDATA_3</name>
									<description>Trace data, bit 3.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD_DCLK</name>
									<description>LCD panel clock.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
