SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
				<register>
					<name>P5_2</name>
					<description>I/O configuration register for pin P5[2]</description>
					<addressOffset>0x288</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P5[2]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P5_2</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_MAT2</name>
									<description>Match output for Timer 3, channel 2.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_SDA</name>
									<description>I2C0 data input/output (this pin uses a specialized
										I2C pad that supports I2C Fast Mode Plus).</description>
									<value>0x5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[5:3]</bitRange>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>HS</name>
							<description>Configures I2C features for standard mode, fast mode, and
								Fast Mode
								Plus operation.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>HS</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>I2C 50ns glitch filter and slew rate control
										enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>I2C 50ns glitch filter and slew rate control
										disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HIDRIVE</name>
							<description>Controls sink current capability of the pin, only for P5[2]
								and
								P5[3].</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>HIDRIVE</name>
								<enumeratedValue>
									<name>LOWDRIVE</name>
									<description>Output drive sink is 4 mA. This is sufficient for
										standard
										and fast mode I2C.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHDRIVE</name>
									<description>Output drive sink is 20 mA. This is needed for Fast
										Mode
										Plus I2C. Refer to the appropriate specific device data
										sheet for
										details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P5_3</name>
					<description>I/O configuration register for pin P5[3]</description>
					<addressOffset>0x28C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P5[3]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P5_3</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U4_RXD</name>
									<description>Receiver input for USART4.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_SCL</name>
									<description>I2C0 clock input/output (this pin uses a
										specialized I2C pad that supports I2C Fast Mode Plus.</description>
									<value>0x5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[5:3]</bitRange>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>HS</name>
							<description>Configures I2C features for standard mode, fast mode, and
								Fast Mode
								Plus operation.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>HS</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>I2C 50ns glitch filter and slew rate control
										enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>I2C 50ns glitch filter and slew rate control
										disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HIDRIVE</name>
							<description>Controls sink current capability of the pin, only for P5[2]
								and
								P5[3].</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>HIDRIVE</name>
								<enumeratedValue>
									<name>LOWDRIVE</name>
									<description>Output drive sink is 4 mA. This is sufficient for
										standard
										and fast mode I2C.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHDRIVE</name>
									<description>Output drive sink is 20 mA. This is needed for Fast
										Mode
										Plus I2C. Refer to the appropriate specific device data
										sheet for
										details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>P5_4</name>
					<description>I/O configuration register for pin P5[4]</description>
					<addressOffset>0x290</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function for pin P5[4]</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>FUNC</name>
								<enumeratedValue>
									<name>P5_4</name>
									<description>General purpose digital input/output
										pin.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U0_OE</name>
									<description>RS-485/EIA-485 output enable signal for UART0.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_MAT3</name>
									<description>Match output for Timer 3, channel 3.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U4_TXD</name>
									<description>Transmitter output for USART4 (input/output in
										smart card mode).</description>
									<value>0x4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor
								control).</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive (no pull-down/pull-up resistor
										enabled).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLDOWN</name>
									<description>Pull-down resistor enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULLUP</name>
									<description>Pull-up resistor enabled.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater mode.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYS</name>
							<description>Hysteresis.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>HYS</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>INV</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Input not inverted (HIGH on pin reads as 1, LOW on
										pin reads as 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Input inverted (HIGH on pin reads as 0, LOW on pin
										reads as 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>SLEW</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled.
										More
										outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the
										appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>OD</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Open-drain mode enabled. This is not a true
										open-drain mode. Input cannot be pulled up above VDD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
