SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
			</registers>


		</peripheral>
		<peripheral>
			<name>SSP1</name>
			<description>SSP1 controller</description>
			<baseAddress>0x40030000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SSP1</name>
				<value>15</value>

			</interrupt>
			<registers>
				<register>
					<name>CR0</name>
					<description>Control Register 0. Selects the serial clock rate, bus type, and
						data size.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSS</name>
							<description>Data Size Select. This field controls the number of bits
								transferred in each frame. Values 0000-0010 are not supported and
								should not be used.</description>
							<bitRange>[3:0]</bitRange>
							<enumeratedValues>
								<name>DSS</name>
								<enumeratedValue>
									<name>4_BIT</name>
									<description>4-bit transfer</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_BIT</name>
									<description>5-bit transfer</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_BIT</name>
									<description>6-bit transfer</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_BIT</name>
									<description>7-bit transfer</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BIT</name>
									<description>8-bit transfer</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BIT</name>
									<description>9-bit transfer</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_BIT</name>
									<description>10-bit transfer</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>11_BIT</name>
									<description>11-bit transfer</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12_BIT</name>
									<description>12-bit transfer</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>13_BIT</name>
									<description>13-bit transfer</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>14_BIT</name>
									<description>14-bit transfer</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15_BIT</name>
									<description>15-bit transfer</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_BIT</name>
									<description>16-bit transfer</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FRF</name>
							<description>Frame Format.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>FRF</name>
								<enumeratedValue>
									<name>SPI</name>
									<description>SPI</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TI</name>
									<description>TI</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICROWIRE</name>
									<description>Microwire</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>This combination is not supported and should not be
										used.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPOL</name>
							<description>Clock Out Polarity. This bit is only used in SPI mode.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>CPOL</name>
								<enumeratedValue>
									<name>BUS_LOW</name>
									<description>SSP controller maintains the bus clock low between
										frames.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUS_HIGH</name>
									<description>SSP controller maintains the bus clock high between
										frames.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPHA</name>
							<description>Clock Out Phase. This bit is only used in SPI mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>CPHA</name>
								<enumeratedValue>
									<name>FIRST_CLOCK</name>
									<description>SSP controller captures serial data on the first
										clock transition of the frame, that is, the transition away
										from the inter-frame state of the clock line.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SECOND_CLOCK</name>
									<description>SSP controller captures serial data on the second
										clock transition of the frame, that is, the transition back
										to the inter-frame state of the clock line.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCR</name>
							<description>Serial Clock Rate. The number of prescaler-output clocks
								per bit on the bus, minus one. Given that CPSDVSR is the prescale
								divider, and the APB clock PCLK clocks the prescaler, the bit
								frequency is PCLK / (CPSDVSR X [SCR+1]).</description>
							<bitRange>[15:8]</bitRange>

