SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:16]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CR1</name>
					<description>Control Register 1. Selects master/slave and other modes.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LBM</name>
							<description>Loop Back Mode.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>LBM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>During normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUPTU</name>
									<description>Serial input is taken from the serial output (MOSI
										or MISO) rather than the serial input pin (MISO or MOSI
										respectively).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSE</name>
							<description>SSP Enable.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>SSE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The SSP controller is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The SSP controller will interact with other devices
										on the serial bus. Software should write the appropriate
										control information to the other SSP registers and interrupt
										controller registers, before setting this bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MS</name>
							<description>Master/Slave Mode.This bit can only be written when the SSE
								bit is 0.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>MS</name>
								<enumeratedValue>
									<name>MASTER</name>
									<description>The SSP controller acts as a master on the bus,
										driving the SCLK, MOSI, and SSEL lines and receiving the
										MISO line.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SLAVE</name>
									<description>The SSP controller acts as a slave on the bus,
										driving MISO line and receiving SCLK, MOSI, and SSEL lines.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOD</name>
							<description>Slave Output Disable. This bit is relevant only in slave
								mode (MS = 1). If it is 1, this blocks this SSP controller from
								driving the transmit data line (MISO).</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<description>Data Register. Writes fill the transmit FIFO, and reads empty the
						receive FIFO.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>DATA</name>
							<description>Write: software can write data to be sent in a future frame
								to this register whenever the TNF bit in the Status register is 1,
								indicating that the Tx FIFO is not full. If the Tx FIFO was
								previously empty and the SSP controller is not busy on the bus,
								transmission of the data will begin immediately. Otherwise the data
								written to this register will be sent as soon as all previous data
								has been sent (and received). If the data length is less than 16
								bits, software must right-justify the data written to this register.
								Read: software can read data from this register whenever the RNE bit
								in the Status register is 1, indicating that the Rx FIFO is not
								empty. When software reads this register, the SSP controller returns
								data from the least recent frame in the Rx FIFO. If the data length
								is less than 16 bits, the data is right-justified in this field with
								higher order bits filled with 0s.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>Status Register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TFE</name>
							<description>Transmit FIFO Empty. This bit is 1 is the Transmit FIFO is
								empty, 0 if not.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TNF</name>
							<description>Transmit FIFO Not Full. This bit is 0 if the Tx FIFO is
								full, 1 if not.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RNE</name>
							<description>Receive FIFO Not Empty. This bit is 0 if the Receive FIFO
								is empty, 1 if not.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RFF</name>
							<description>Receive FIFO Full. This bit is 1 if the Receive FIFO is
								full, 0 if not.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>BSY</name>
							<description>Busy. This bit is 0 if the SSPn controller is idle, or 1 if
								it is currently sending/receiving a frame and/or the Tx FIFO is not
								empty.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CPSR</name>
					<description>Clock Prescale Register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CPSDVSR</name>
							<description>This even value between 2 and 254, by which PCLK is divided
								to yield the prescaler output clock. Bit 0 always reads as 0.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IMSC</name>
					<description>Interrupt Mask Set and Clear Register</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RORIM</name>
							<description>Software should set this bit to enable interrupt when a
								Receive Overrun occurs, that is, when the Rx FIFO is full and
								another frame is completely received. The ARM spec implies that the
								preceding frame data is overwritten by the new frame data when this
								occurs.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RTIM</name>
							<description>Software should set this bit to enable interrupt when a
								Receive Time-out condition occurs. A Receive Time-out occurs when
								the Rx FIFO is not empty, and no has not been read for a time-out
								period. The time-out period is the same for master and slave modes
								and is determined by the SSP bit rate: 32 bits at PCLK / (CPSDVSR X
								[SCR+1]).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXIM</name>
							<description>Software should set this bit to enable interrupt when the
								Rx FIFO is at least half full.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>TXIM</name>
							<description>Software should set this bit to enable interrupt when the
								Tx FIFO is at least half empty.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RIS</name>
					<description>Raw Interrupt Status Register</description>
					<addressOffset>0x018</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000008</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RORRIS</name>
							<description>This bit is 1 if another frame was completely received
								while the RxFIFO was full. The ARM spec implies that the preceding
								frame data is overwritten by the new frame data when this occurs.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RTRIS</name>
							<description>This bit is 1 if the Rx FIFO is not empty, and has not been
								read for a time-out period. The time-out period is the same for
								master and slave modes and is determined by the SSP bit rate: 32
								bits at PCLK / (CPSDVSR X [SCR+1]).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXRIS</name>
							<description>This bit is 1 if the Rx FIFO is at least half full.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>TXRIS</name>
							<description>This bit is 1 if the Tx FIFO is at least half empty.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MIS</name>
					<description>Masked Interrupt Status Register</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RORMIS</name>
							<description>This bit is 1 if another frame was completely received
								while the RxFIFO was full, and this interrupt is enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RTMIS</name>
							<description>This bit is 1 if the Rx FIFO is not empty, has not been
								read for a time-out period, and this interrupt is enabled. The
								time-out period is the same for master and slave modes and is
								determined by the SSP bit rate: 32 bits at PCLK / (CPSDVSR X
								[SCR+1]).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXMIS</name>
							<description>This bit is 1 if the Rx FIFO is at least half full, and
								this interrupt is enabled.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>TXMIS</name>
							<description>This bit is 1 if the Tx FIFO is at least half empty, and
								this interrupt is enabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>SSPICR Interrupt Clear Register</description>
					<addressOffset>0x020</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RORIC</name>
							<description>Writing a 1 to this bit clears the frame was received when
								RxFIFO was full interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RTIC</name>
							<description>Writing a 1 to this bit clears the Rx FIFO was not empty
								and has not been read for a time-out period interrupt. The time-out
								period is the same for master and slave modes and is determined by
								the SSP bit rate: 32 bits at PCLK / (CPSDVSR / [SCR+1]).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACR</name>
					<description>SSP0 DMA control register</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXDMAE</name>
							<description>Receive DMA Enable. When this bit is set to one 1, DMA for
								the receive FIFO is enabled, otherwise receive DMA is disabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXDMAE</name>
							<description>Transmit DMA Enable. When this bit is set to one 1, DMA for
								the transmit FIFO is enabled, otherwise transmit DMA is disabled</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
