SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>GDR</name>
					<description>A/D Global Data Register. This register contains the ADC's DONE bit
						and the result of the most recent A/D conversion.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESULT</name>
							<description>When DONE is 1, this field contains a binary fraction
								representing the voltage on the AD0[n] pin selected by the SEL
								field, as it falls within the range of VREFP to VSS. Zero in the
								field indicates that the voltage on the input pin was less than,
								equal to, or close to that on VSS, while 0xFFF indicates that the
								voltage on the input was close to, equal to, or greater than that on
								VREFP.</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>CHN</name>
							<description>These bits contain the channel from which the RESULT bits
								were converted (e.g. 000 identifies channel 0, 001 channel 1...).</description>
							<bitRange>[26:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[29:27]</bitRange>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>This bit is 1 in burst mode if the results of one or more
								conversions was (were) lost and overwritten before the conversion
								that produced the result in the RESULT bits. This bit is cleared by
								reading this register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DONE</name>
							<description>This bit is set to 1 when an A/D conversion completes. It
								is cleared when this register is read and when the ADCR is written.
								If the ADCR is written while a conversion is still in progress, this
								bit is set and a new conversion is started.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<description>A/D Interrupt Enable Register. This register contains enable bits
						that allow the DONE flag of each A/D channel to be included or excluded from
						contributing to the generation of an A/D interrupt.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADINTEN0</name>
							<description>Interrupt enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ADINTEN0</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 0 will
										not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 0 will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN1</name>
							<description>Interrupt enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ADINTEN1</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 1 will
										not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 1 will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN2</name>
							<description>Interrupt enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ADINTEN2</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 2 will
										not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 2 will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN3</name>
							<description>Interrupt enable</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ADINTEN3</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 3 will
										not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 3 will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN4</name>
							<description>Interrupt enable</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ADINTEN4</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 4 will
										not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 4 will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN5</name>
							<description>Interrupt enable</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ADINTEN5</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 5 will
										not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 5 will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN6</name>
							<description>Interrupt enable</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ADINTEN6</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 6 will
										not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 6 will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN7</name>
							<description>Interrupt enable</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ADINTEN7</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 7 will
										not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 7 will
										generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADGINTEN</name>
							<description>Interrupt enable</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ADGINTEN</name>
								<enumeratedValue>
									<name>CHANNELS</name>
									<description>Only the individual ADC channels enabled by
										ADINTEN7:0 will generate interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GLOBAL</name>
									<description>The global DONE flag in ADDR is enabled to generate
										an interrupt in addition to any individual ADC channels that
										are enabled to generate interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:9]</bitRange>

