SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
			</registers>
		</peripheral>


		<peripheral>
			<name>CANAFRAM</name>
			<description>CAN acceptance filter RAM</description>
			<baseAddress>0x40038000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>512</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-511</dimIndex>
					<name>MASK[%s]</name>

					<displayName>MASK[%s]</displayName>
					<description>CAN AF ram access register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MASK</name>
							<description>CAN AF RAM mask</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral>
			<name>CANAF</name>
			<description> CAN controller acceptance filter </description>
			<groupName>CANAF</groupName>
			<baseAddress>0x4003C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>AFMR</name>
					<description>Acceptance Filter Register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ACCOFF</name>
							<description>if AccBP is 0, the Acceptance Filter is not operational.
								All Rx messages on all CAN buses are ignored.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>ACCBP</name>
							<description>All Rx messages are accepted on enabled CAN controllers.
								Software must set this bit before modifying the contents of any of
								the registers described below, and before modifying the contents of
								Lookup Table RAM in any way other than setting or clearing Disable
								bits in Standard Identifier entries. When both this bit and AccOff
								are 0, the Acceptance filter operates to screen received CAN
								Identifiers.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EFCAN</name>
							<description>FullCAN mode</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>EFCAN</name>
								<enumeratedValue>
									<name>SOFTWARE</name>
									<description>Software must read all messages for all enabled IDs
										on all enabled CAN buses, from the receiving CAN
										controllers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AC_FILTER</name>
									<description>The Acceptance Filter itself will take care of
										receiving and storing messages for selected Standard ID
										values on selected CAN buses. See Section 21.16 FullCAN mode
										on page 576.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SFF_SA</name>
					<description>Standard Frame Individual Start Address Register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>SFF_SA</name>
							<description>The start address of the table of individual Standard
								Identifiers in AF Lookup RAM. If the table is empty, write the same
								value in this register and the SFF_GRP_sa register described below.
								For compatibility with possible future devices, write zeroes in bits
								31:11 and 1:0 of this register. If the eFCAN bit in the AFMR is 1,
								this value also indicates the size of the table of Standard IDs
								which the Acceptance Filter will search and (if found) automatically
								store received messages in Acceptance Filter RAM.</description>
							<bitRange>[10:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SFF_GRP_SA</name>
					<description>Standard Frame Group Start Address Register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>SFF_GRP_SA</name>
							<description>The start address of the table of grouped Standard
								Identifiers in AF Lookup RAM. If the table is empty, write the same
								value in this register and the EFF_sa register described below. The
								largest value that should be written to this register is 0x800, when
								only the Standard Individual table is used, and the last word
								(address 0x7FC) in AF Lookup Table RAM is used. For compatibility
								with possible future devices, please write zeroes in bits 31:12 and
								1:0 of this register.</description>
							<bitRange>[11:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EFF_SA</name>
					<description>Extended Frame Start Address Register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>EFF_SA</name>
							<description>The start address of the table of individual Extended
								Identifiers in AF Lookup RAM. If the table is empty, write the same
								value in this register and the EFF_GRP_sa register described below.
								The largest value that should be written to this register is 0x800,
								when both Extended Tables are empty and the last word (address
								0x7FC) in AF Lookup Table RAM is used. For compatibility with
								possible future devices, please write zeroes in bits 31:11 and 1:0
								of this register.</description>
							<bitRange>[10:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EFF_GRP_SA</name>
					<description>Extended Frame Group Start Address Register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>EFF_GRP_SA</name>
							<description>The start address of the table of grouped Extended
								Identifiers in AF Lookup RAM. If the table is empty, write the same
								value in this register and the ENDofTable register described below.
								The largest value that should be written to this register is 0x800,
								when this table is empty and the last word (address 0x7FC) in AF
								Lookup Table RAM is used. For compatibility with possible future
								devices, please write zeroes in bits 31:12 and 1:0 of this register.</description>
							<bitRange>[11:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDOFTABLE</name>
					<description>End of AF Tables register</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>ENDOFTABLE</name>
							<description>The address above the last active address in the last
								active AF table. For compatibility with possible future devices,
								please write zeroes in bits 31:12 and 1:0 of this register. If the
								eFCAN bit in the AFMR is 0, the largest value that should be written
								to this register is 0x800, which allows the last word (address
								0x7FC) in AF Lookup Table RAM to be used. If the eFCAN bit in the
								AFMR is 1, this value marks the start of the area of Acceptance
								Filter RAM, into which the Acceptance Filter will automatically
								receive messages for selected IDs on selected CAN buses. In this
								case, the maximum value that should be written to this register is
								0x800 minus 6 times the value in SFF_sa. This allows 12 bytes of
								message storage between this address and the end of Acceptance
								Filter RAM, for each Standard ID that is specified between the start
								of Acceptance Filter RAM, and the next active AF table.</description>
							<bitRange>[11:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>LUTERRAD</name>
					<description>LUT Error Address register</description>
					<addressOffset>0x018</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>LUTERRAD</name>
							<description>It the LUT Error bit (below) is 1, this read-only field
								contains the address in AF Lookup Table RAM, at which the Acceptance
								Filter encountered an error in the content of the tables.</description>
							<bitRange>[10:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>LUTERR</name>
					<description>LUT Error Register</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LUTERR</name>
							<description>This read-only bit is set to 1 if the Acceptance Filter
								encounters an error in the content of the tables in AF RAM. It is
								cleared when software reads the LUTerrAd register. This condition is
								ORed with the other CAN interrupts from the CAN controllers, to
								produce the request that is connected to the NVIC.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FCANIE</name>
					<description>FullCAN interrupt enable register</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FCANIE</name>
							<description>Global FullCAN Interrupt Enable. When 1, this interrupt is
								enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FCANIC0</name>
					<description>FullCAN interrupt and capture register0</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTPND</name>
							<description>FullCan Interrupt Pending 0 = FullCan Interrupt Pending bit
								0. 1 = FullCan Interrupt Pending bit 1. ... 31 = FullCan Interrupt
								Pending bit 31.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FCANIC1</name>
					<description>FullCAN interrupt and capture register1</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IntPnd32</name>
							<description>FullCan Interrupt Pending bit 32. 0 = FullCan Interrupt
								Pending bit 32. 1 = FullCan Interrupt Pending bit 33. ... 31 =
								FullCan Interrupt Pending bit 63.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
