SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CAN1</name>
			<description>CAN1 controller </description>
			<groupName>CAN</groupName>
			<baseAddress>0x40044000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CAN</name>
				<value>25</value>
			</interrupt>
			<registers>
				<register>
					<name>MOD</name>
					<description>Controls the operating mode of the CAN Controller.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RM</name>
							<description>Reset Mode.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>RM</name>
								<enumeratedValue>
									<name>OPERATING</name>
									<description>Normal.The CAN Controller is in the Operating Mode,
										and certain registers can not be written.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset. CAN operation is disabled, writable
										registers can be written and the current
										transmission/reception of a message is aborted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOM</name>
							<description>Listen Only Mode.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>LOM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Normal. The CAN controller acknowledges a
										successfully received message on the CAN bus. The error
										counters are stopped at the current value.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Listen only. The controller gives no
										acknowledgment, even if a message is successfully received.
										Messages cannot be sent, and the controller operates in
										error passive mode. This mode is intended for software bit
										rate detection and hot plugging.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STM</name>
							<description>Self Test Mode.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>STM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Normal. A transmitted message must be acknowledged
										to be considered successful.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Self test. The controller will consider a Tx
										message successful even if there is no acknowledgment
										received. In this mode a full node test is possible without
										any other active node on the bus using the SRR bit in
										CANxCMR.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TPM</name>
							<description>Transmit Priority Mode.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>TPM</name>
								<enumeratedValue>
									<name>CAN_ID</name>
									<description>CAN ID. The transmit priority for 3 Transmit
										Buffers depends on the CAN Identifier.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCAL</name>
									<description>Local priority. The transmit priority for 3
										Transmit Buffers depends on the contents of the Tx Priority
										register within the Transmit Buffer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SM</name>
							<description>Sleep Mode.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>SM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Wake-up. Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Sleep. The CAN controller enters Sleep Mode if no
										CAN interrupt is pending and there is no bus activity. See
										the Sleep Mode description Section 21.8.2 on page 565.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RPM</name>
							<description>Receive Polarity Mode.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>RPM</name>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Low active. RD input is active Low (dominant bit =
										0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>High active. RD input is active High (dominant bit
										= 1) -- reverse polarity.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>TM</name>
							<description>Test Mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>TM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The TD pin will reflect the bit, detected
										on RD pin, with the next positive edge of the system clock.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>

