SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>RXERR</name>
							<description>The current value of the Rx Error Counter (an 8-bit value).</description>
							<bitRange>[23:16]</bitRange>

						</field>
						<field>
							<name>TXERR</name>
							<description>The current value of the Tx Error Counter (an 8-bit value).</description>
							<bitRange>[31:24]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>Interrupt status, Arbitration Lost Capture, Error Code Capture</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RI</name>
							<description>Receive Interrupt. This bit is set whenever the RBS bit in
								CANxSR and the RIE bit in CANxIER are both 1, indicating that a new
								message was received and stored in the Receive Buffer. The Receive
								Interrupt Bit is not cleared upon a read access to the Interrupt
								Register. Giving the Command Release Receive Buffer will clear RI
								temporarily. If there is another message available within the
								Receive Buffer after the release command, RI is set again. Otherwise
								RI remains cleared.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>RI</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TI1</name>
							<description>Transmit Interrupt 1. This bit is set when the TBS1 bit in
								CANxSR goes from 0 to 1 (whenever a message out of TXB1 was
								successfully transmitted or aborted), indicating that Transmit
								buffer 1 is available, and the TIE1 bit in CANxIER is 1.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>TI1</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EI</name>
							<description>Error Warning Interrupt. This bit is set on every change
								(set or clear) of either the Error Status or Bus Status bit in
								CANxSR and the EIE bit bit is set within the Interrupt Enable
								Register at the time of the change.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>EI</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DOI</name>
							<description>Data Overrun Interrupt. This bit is set when the DOS bit in
								CANxSR goes from 0 to 1 and the DOIE bit in CANxIER is 1.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>DOI</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUI</name>
							<description>Wake-Up Interrupt. This bit is set if the CAN controller is
								sleeping and bus activity is detected and the WUIE bit in CANxIER is
								1. A Wake-Up Interrupt is also generated if the CPU tries to set the
								Sleep bit while the CAN controller is involved in bus activities or
								a CAN Interrupt is pending. The WUI flag can also get asserted when
								the according enable bit WUIE is not set. In this case a Wake-Up
								Interrupt does not get asserted.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>WUI</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPI</name>
							<description>Error Passive Interrupt. This bit is set if the EPIE bit in
								CANxIER is 1, and the CAN controller switches between Error Passive
								and Error Active mode in either direction. This is the case when the
								CAN Controller has reached the Error Passive Status (at least one
								error counter exceeds the CAN protocol defined level of 127) or if
								the CAN Controller is in Error Passive Status and enters the Error
								Active Status again.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>EPI</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALI</name>
							<description>Arbitration Lost Interrupt. This bit is set if the ALIE bit
								in CANxIER is 1, and the CAN controller loses arbitration while
								attempting to transmit. In this case the CAN node becomes a
								receiver.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ALI</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BEI</name>
							<description>Bus Error Interrupt -- this bit is set if the BEIE bit in
								CANxIER is 1, and the CAN controller detects an error on the bus.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>BEI</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDI</name>
							<description>ID Ready Interrupt -- this bit is set if the IDIE bit in
								CANxIER is 1, and a CAN Identifier has been received (a message was
								successfully transmitted or aborted). This bit is set whenever a
								message was successfully transmitted or aborted and the IDIE bit is
								set in the IER register.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>IDI</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TI2</name>
							<description>Transmit Interrupt 2. This bit is set when the TBS2 bit in
								CANxSR goes from 0 to 1 (whenever a message out of TXB2 was
								successfully transmitted or aborted), indicating that Transmit
								buffer 2 is available, and the TIE2 bit in CANxIER is 1.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>TI2</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TI3</name>
							<description>Transmit Interrupt 3. This bit is set when the TBS3 bit in
								CANxSR goes from 0 to 1 (whenever a message out of TXB3 was
								successfully transmitted or aborted), indicating that Transmit
								buffer 3 is available, and the TIE3 bit in CANxIER is 1.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>TI3</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[15:11]</bitRange>

