SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>ERRBIT4_0</name>
							<description>Error Code Capture: when the CAN controller detects a bus
								error, the location of the error within the frame is captured in
								this field. The value reflects an internal state variable, and as a
								result is not very linear: 00011 = Start of Frame 00010 = ID28 ...
								ID21 00110 = ID20 ... ID18 00100 = SRTR Bit 00101 = IDE bit 00111 =
								ID17 ... 13 01111 = ID12 ... ID5 01110 = ID4 ... ID0 01100 = RTR Bit
								01101 = Reserved Bit 1 01001 = Reserved Bit 0 01011 = Data Length
								Code 01010 = Data Field 01000 = CRC Sequence 11000 = CRC Delimiter
								11001 = Acknowledge Slot 11011 = Acknowledge Delimiter 11010 = End
								of Frame 10010 = Intermission Whenever a bus error occurs, the
								corresponding bus error interrupt is forced, if enabled. At the same
								time, the current position of the Bit Stream Processor is captured
								into the Error Code Capture Register. The content within this
								register is fixed until the user software has read out its content
								once. From now on, the capture mechanism is activated again, i.e.
								reading the CANxICR enables another Bus Error Interrupt.</description>
							<bitRange>[20:16]</bitRange>

						</field>
						<field>
							<name>ERRDIR</name>
							<description>When the CAN controller detects a bus error, the direction
								of the current bit is captured in this bit.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ERRDIR</name>
								<enumeratedValue>
									<name>TRANSMIT</name>
									<description>Error occurred during transmitting.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RECEIVE</name>
									<description>Error occurred during receiving.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERRC1_0</name>
							<description>When the CAN controller detects a bus error, the type of
								error is captured in this field:</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ERRC1_0</name>
								<enumeratedValue>
									<name>BIT_ERROR</name>
									<description>Bit error</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORM_ERROR</name>
									<description>Form error</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STUFF_ERROR</name>
									<description>Stuff error</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OTHER_ERROR</name>
									<description>Other error</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALCBIT</name>
							<description>Each time arbitration is lost while trying to send on the
								CAN, the bit number within the frame is captured into this field.
								After the content of ALCBIT is read, the ALI bit is cleared and a
								new Arbitration Lost interrupt can occur. 00 = arbitration lost in
								the first bit (MS) of identifier ... 11 = arbitration lost in SRTS
								bit (RTR bit for standard frame messages) 12 = arbitration lost in
								IDE bit 13 = arbitration lost in 12th bit of identifier (extended
								frame only) ... 30 = arbitration lost in last bit of identifier
								(extended frame only) 31 = arbitration lost in RTR bit (extended
								frame only) On arbitration lost, the corresponding arbitration lost
								interrupt is forced, if enabled. At that time, the current bit
								position of the Bit Stream Processor is captured into the
								Arbitration Lost Capture Register. The content within this register
								is fixed until the user application has read out its contents once.
								From now on, the capture mechanism is activated again.</description>
							<bitRange>[31:24]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<description>Interrupt Enable</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RIE</name>
							<description>Receiver Interrupt Enable. When the Receive Buffer Status
								is 'full', the CAN Controller requests the respective interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TIE1</name>
							<description>Transmit Interrupt Enable for Buffer1. When a message has
								been successfully transmitted out of TXB1 or Transmit Buffer 1 is
								accessible again (e.g. after an Abort Transmission command), the CAN
								Controller requests the respective interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EIE</name>
							<description>Error Warning Interrupt Enable. If the Error or Bus Status
								change (see Status Register), the CAN Controller requests the
								respective interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DOIE</name>
							<description>Data Overrun Interrupt Enable. If the Data Overrun Status
								bit is set (see Status Register), the CAN Controller requests the
								respective interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>WUIE</name>
							<description>Wake-Up Interrupt Enable. If the sleeping CAN controller
								wakes up, the respective interrupt is requested.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EPIE</name>
							<description>Error Passive Interrupt Enable. If the error status of the
								CAN Controller changes from error active to error passive or vice
								versa, the respective interrupt is requested.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ALIE</name>
							<description>Arbitration Lost Interrupt Enable. If the CAN Controller
								has lost arbitration, the respective interrupt is requested.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>BEIE</name>
							<description>Bus Error Interrupt Enable. If a bus error has been
								detected, the CAN Controller requests the respective interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>IDIE</name>
							<description>ID Ready Interrupt Enable. When a CAN identifier has been
								received, the CAN Controller requests the respective interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TIE2</name>
							<description>Transmit Interrupt Enable for Buffer2. When a message has
								been successfully transmitted out of TXB2 or Transmit Buffer 2 is
								accessible again (e.g. after an Abort Transmission command), the CAN
								Controller requests the respective interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>TIE3</name>
							<description>Transmit Interrupt Enable for Buffer3. When a message has
								been successfully transmitted out of TXB3 or Transmit Buffer 3 is
								accessible again (e.g. after an Abort Transmission command), the CAN
								Controller requests the respective interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BTR</name>
					<description>Bus Timing. Can only be written when RM in CANMOD is 1.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0x1C0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BRP</name>
							<description>Baud Rate Prescaler. The APB clock is divided by (this
								value plus one) to produce the CAN clock.</description>
							<bitRange>[9:0]</bitRange>

