SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[13:10]</bitRange>

						</field>
						<field>
							<name>SJW</name>
							<description>The Synchronization Jump Width is (this value plus one) CAN
								clocks.</description>
							<bitRange>[15:14]</bitRange>

						</field>
						<field>
							<name>TESG1</name>
							<description>The delay from the nominal Sync point to the sample point
								is (this value plus one) CAN clocks.</description>
							<bitRange>[19:16]</bitRange>

						</field>
						<field>
							<name>TESG2</name>
							<description>The delay from the sample point to the next nominal sync
								point is (this value plus one) CAN clocks. The nominal CAN bit time
								is (this value plus the value in TSEG1 plus 3) CAN clocks.</description>
							<bitRange>[22:20]</bitRange>

						</field>
						<field>
							<name>SAM</name>
							<description>Sampling</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>SAM</name>
								<enumeratedValue>
									<name>ONCE</name>
									<description>The bus is sampled once (recommended for high speed
										buses)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_TIMES</name>
									<description>The bus is sampled 3 times (recommended for low to
										medium speed buses to filter spikes on the bus-line)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:24]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>EWL</name>
					<description>Error Warning Limit. Can only be written when RM in CANMOD is 1.</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0x60</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EWL</name>
							<description>During CAN operation, this value is compared to both the Tx
								and Rx Error Counters. If either of these counter matches this
								value, the Error Status (ES) bit in CANSR is set.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>Status Register</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-only</access>
					<resetValue>0x3C3C3C</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RBS_1</name>
							<description>Receive Buffer Status. This bit is identical to the RBS bit
								in the CANxGSR.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>DOS_1</name>
							<description>Data Overrun Status. This bit is identical to the DOS bit
								in the CANxGSR.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>TBS1_1</name>
							<description>Transmit Buffer Status 1.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>TBS1_1</name>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Locked. Software cannot access the Tx Buffer 1 nor
										write to the corresponding CANxTFI, CANxTID, CANxTDA, and
										CANxTDB registers because a message is either waiting for
										transmission or is in transmitting process.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RELEASED</name>
									<description>Released. Software may write a message into the
										Transmit Buffer 1 and its CANxTFI, CANxTID, CANxTDA, and
										CANxTDB registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TCS1_1</name>
							<description>Transmission Complete Status.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>TCS1_1</name>
								<enumeratedValue>
									<name>INCOMPLETE</name>
									<description>Incomplete. The previously requested transmission
										for Tx Buffer 1 is not complete.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMPLETE</name>
									<description>Complete. The previously requested transmission for
										Tx Buffer 1 has been successfully completed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RS_1</name>
							<description>Receive Status. This bit is identical to the RS bit in the
								GSR.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>TS1_1</name>
							<description>Transmit Status 1.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>TS1_1</name>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Idle. There is no transmission from Tx Buffer 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRANSMIT</name>
									<description>Transmit. The CAN Controller is transmitting a
										message from Tx Buffer 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ES_1</name>
							<description>Error Status. This bit is identical to the ES bit in the
								CANxGSR.</description>
							<bitRange>[6:6]</bitRange>

