SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>BS_1</name>
							<description>Bus Status. This bit is identical to the BS bit in the
								CANxGSR.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>RBS_2</name>
							<description>Receive Buffer Status. This bit is identical to the RBS bit
								in the CANxGSR.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>DOS_2</name>
							<description>Data Overrun Status. This bit is identical to the DOS bit
								in the CANxGSR.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>TBS2_2</name>
							<description>Transmit Buffer Status 2.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>TBS2_2</name>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Locked. Software cannot access the Tx Buffer 2 nor
										write to the corresponding CANxTFI, CANxTID, CANxTDA, and
										CANxTDB registers because a message is either waiting for
										transmission or is in transmitting process.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RELEASED</name>
									<description>Released. Software may write a message into the
										Transmit Buffer 2 and its CANxTFI, CANxTID, CANxTDA, and
										CANxTDB registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TCS2_2</name>
							<description>Transmission Complete Status.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>TCS2_2</name>
								<enumeratedValue>
									<name>INCOMPLETE</name>
									<description>Incomplete. The previously requested transmission
										for Tx Buffer 2 is not complete.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMPLETE</name>
									<description>Complete. The previously requested transmission for
										Tx Buffer 2 has been successfully completed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RS_2</name>
							<description>Receive Status. This bit is identical to the RS bit in the
								GSR.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>TS2_2</name>
							<description>Transmit Status 2.</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>TS2_2</name>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Idle. There is no transmission from Tx Buffer 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRANSMIT</name>
									<description>Transmit. The CAN Controller is transmitting a
										message from Tx Buffer 2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ES_2</name>
							<description>Error Status. This bit is identical to the ES bit in the
								CANxGSR.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>BS_2</name>
							<description>Bus Status. This bit is identical to the BS bit in the
								CANxGSR.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>RBS_3</name>
							<description>Receive Buffer Status. This bit is identical to the RBS bit
								in the CANxGSR.</description>
							<bitRange>[16:16]</bitRange>

						</field>
						<field>
							<name>DOS_3</name>
							<description>Data Overrun Status. This bit is identical to the DOS bit
								in the CANxGSR.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>TBS3_3</name>
							<description>Transmit Buffer Status 3.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>TBS3_3</name>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Locked. Software cannot access the Tx Buffer 3 nor
										write to the corresponding CANxTFI, CANxTID, CANxTDA, and
										CANxTDB registers because a message is either waiting for
										transmission or is in transmitting process.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RELEASED</name>
									<description>Released. Software may write a message into the
										Transmit Buffer 3 and its CANxTFI, CANxTID, CANxTDA, and
										CANxTDB registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TCS3_3</name>
							<description>Transmission Complete Status.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>TCS3_3</name>
								<enumeratedValue>
									<name>INCOMPLETE</name>
									<description>Incomplete. The previously requested transmission
										for Tx Buffer 3 is not complete.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMPLETE</name>
									<description>Complete. The previously requested transmission for
										Tx Buffer 3 has been successfully completed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RS_3</name>
							<description>Receive Status. This bit is identical to the RS bit in the
								GSR.</description>
							<bitRange>[20:20]</bitRange>

						</field>
						<field>
							<name>TS3_3</name>
							<description>Transmit Status 3.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>TS3_3</name>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Idle. There is no transmission from Tx Buffer 3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRANSMIT</name>
									<description>Transmit. The CAN Controller is transmitting a
										message from Tx Buffer 3.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ES_3</name>
							<description>Error Status. This bit is identical to the ES bit in the
								CANxGSR.</description>
							<bitRange>[22:22]</bitRange>

