SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>ABEOINTEN</name>
							<description>Enables the end of auto-baud interrupt.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ABEOINTEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable end of auto-baud Interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable end of auto-baud Interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ABTOINTEN</name>
							<description>Enables the auto-baud time-out interrupt.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ABTOINTEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable auto-baud time-out Interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable auto-baud time-out Interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>IIR</name>
					<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-only</access>
					<resetValue>0x01</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTSTATUS</name>
							<description>Interrupt status. Note that U4IIR[0] is active low. The
								pending interrupt can be determined by evaluating U4IIR[3:1].</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>INTSTATUS</name>
								<enumeratedValue>
									<name>PENDING</name>
									<description>At least one interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>No interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INTID</name>
							<description>Interrupt identification. U4IER[3:1] identifies an
								interrupt corresponding to the UART4 Rx or TX FIFO. All other
								combinations of U4IER[3:1] not listed below are reserved
								(000,100,101,111).</description>
							<bitRange>[3:1]</bitRange>
							<enumeratedValues>
								<name>INTID</name>
								<enumeratedValue>
									<name>RLS</name>
									<description>1 - Receive Line Status (RLS).</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RDA</name>
									<description>2a - Receive Data Available (RDA).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTI</name>
									<description>2b - Character Time-out Indicator (CTI).</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THRE</name>
									<description>3 - THRE Interrupt</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[5:4]</bitRange>

						</field>
						<field>
							<name>FIFOENABLE</name>
							<description>Copies of U4FCR[0].</description>
							<bitRange>[7:6]</bitRange>

						</field>
						<field>
							<name>ABEOINT</name>
							<description>End of auto-baud interrupt. True if auto-baud has finished
								successfully and interrupt is enabled.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>ABTOINT</name>
							<description>Auto-baud time-out interrupt. True if auto-baud has timed
								out and interrupt is enabled.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>FCR</name>
					<description>FIFO Control Register. Controls UART FIFO usage and modes.</description>
					<alternateRegister>IIR</alternateRegister>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FIFOEN</name>
							<description>FIFO Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>FIFOEN</name>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>UARTn FIFOs are disabled. Must not be used in the
										application.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Active high enable for both UARTn Rx and TX FIFOs
										and UnFCR[7:1] access. This bit must be set for proper UART
										operation. Any transition on this bit will automatically
										clear the related UART FIFOs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFIFORES</name>
							<description>RX FIFO Reset.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>RXFIFORES</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>No impact on either of UARTn FIFOs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Writing a logic 1 to UnFCR[1] will clear all bytes
										in UARTn Rx FIFO, reset the pointer logic. This bit is
										self-clearing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXFIFORES</name>
							<description>TX FIFO Reset.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>TXFIFORES</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>No impact on either of UARTn FIFOs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Writing a logic 1 to UnFCR[2] will clear all bytes
										in UARTn TX FIFO, reset the pointer logic. This bit is
										self-clearing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAMODE</name>
							<description>DMA Mode Select. When the FIFO enable (bit 0 of this
								register) is set, this bit selects the DMA mode. See Section
								20.6.6.1.</description>
							<bitRange>[3:3]</bitRange>

