SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>SCR</name>
					<description>Scratch Pad Register. 8-bit temporary storage for software.</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Pad</name>
							<description>A readable, writable byte.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ACR</name>
					<description>Auto-baud Control Register. Contains controls for the auto-baud
						feature.</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Start bit. This bit is automatically cleared after
								auto-baud completion.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>START</name>
								<enumeratedValue>
									<name>STOPPED</name>
									<description>Auto-baud stop (auto-baud is not running).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STARTED</name>
									<description>Auto-baud start (auto-baud is running). Auto-baud
										run bit. This bit is automatically cleared after auto-baud
										completion.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Auto-baud mode select bit.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>MODE_0</name>
									<description>Mode 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE_1</name>
									<description>Mode 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTORESTART</name>
							<description>Restart bit.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>AUTORESTART</name>
								<enumeratedValue>
									<name>NO_RESTART</name>
									<description>No restart.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESTART_ON_TIMEOUT</name>
									<description>Restart in case of time-out (counter restarts at
										next UARTn Rx falling edge)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:3]</bitRange>

						</field>
						<field>
							<name>ABEOINTCLR</name>
							<description>End of auto-baud interrupt clear bit (write-only
								accessible). Writing a 1 will clear the corresponding interrupt in
								the UnIIR. Writing a 0 has no impact.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ABEOINTCLR</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>No impact.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear the corresponding interrupt in the IIR.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ABTOINTCLR</name>
							<description>Auto-baud time-out interrupt clear bit (write-only
								accessible). Writing a 1 will clear the corresponding interrupt in
								the UnIIR. Writing a 0 has no impact.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ABTOINTCLR</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>No impact.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear the corresponding interrupt in the IIR.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>IrDA Control Register. Enables and configures the IrDA mode.</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IRDAEN</name>
							<description>IrDA mode</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>IRDAEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. IrDA mode on UART4 is disabled, UART4
										acts as a standard UART.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. IrDA mode on UART4 is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRDAINV</name>
							<description>Serial input direction.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>IRDAINV</name>
								<enumeratedValue>
									<name>NOT_INVERTED</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERTED</name>
									<description>Inverted. This has no effect on the serial output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIXPULSEEN</name>
							<description>IrDA fixed pulse width mode.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>FIXPULSEEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSEDIV</name>
							<description>Configures the pulse when FixPulseEn = 1.</description>
							<bitRange>[5:3]</bitRange>
							<enumeratedValues>
								<name>PULSEDIV</name>
								<enumeratedValue>
									<name>2XTPCLK</name>
									<description>2xTPCLK</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4XTPCLK</name>
									<description>4xTPCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8XTPCLK</name>
									<description>8xTPCLK</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16XTPCLK</name>
									<description>16xTPCLK</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32XTPCLK</name>
									<description>32xTPCLK</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64XTPCLK</name>
									<description>64xTPCLK</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128XTPCLK</name>
									<description>128xTPCLK</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>256XTPCLK</name>
									<description>256xTPCLK</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>

