SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>Fractional Divider Register. Generates a clock input for the baud
						rate divider.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0x10</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIVADDVAL</name>
							<description>Baud Rate generation pre-scaler divisor value. If this
								field is 0, fractional baud rate generator will not impact the UART4
								baud rate.</description>
							<bitRange>[3:0]</bitRange>

						</field>
						<field>
							<name>MULVAL</name>
							<description>Baud Rate pre-scaler multiplier value. This field must be
								greater or equal 1 for UART4 to operate properly, regardless of
								whether the fractional baud rate generator is used or not.</description>
							<bitRange>[7:4]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>OSR</name>
					<description>Oversampling register. Controls the degree of oversampling during
						each bit time.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0xF0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>OSFRAC</name>
							<description>Fractional part of the oversampling ratio, in units of
								1/8th of an input clock period. (001 = 0.125, ..., 111 = 0.875)</description>
							<bitRange>[3:1]</bitRange>
						</field>
						<field>
							<name>OSINT</name>
							<description>Integer part of the oversampling ratio, minus 1. The reset
								values equate to the normal operating mode of 16 input clocks per
								bit time.</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>FDINT</name>
							<description>In smartcard mode, these bits act as a more-significant
								extension of the OSint field, allowing an oversampling ratio up to
								2048 as required by ISO7816-3. In smartcard mode, bits 14:4 should
								initially be set to 371, yielding an oversampling ratio of 372.</description>
							<bitRange>[14:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:15]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SCICTRL</name>
					<description>Smart Card Interface control register. Enables and configures the
						smartcard Interface feature.</description>
					<addressOffset>0x048</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCIEN</name>
							<description>Smart Card Interface Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>SCIEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Smart card interface disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Asynchronous half duplex smart card interface is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NACKDIS</name>
							<description>NACK response disable. Only applicable in T=0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>NACKDIS</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>A NACK response is enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>A NACK response is inhibited.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROTSEL</name>
							<description>Protocol selection as defined in the ISO7816-3 standard.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>PROTSEL</name>
								<enumeratedValue>
									<name>T_EQ_0</name>
									<description>T = 0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T_EQ_1</name>
									<description>T = 1</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXRETRY</name>
							<description>Maximum number of retransmissions in case of a negative
								acknowledge (protocol T=0). When the retry counter is exceeded, the
								USART will be locked until the FIFO is cleared. A TX error interrupt
								is generated when enabled.</description>
							<bitRange>[7:5]</bitRange>

						</field>
						<field>
							<name>GUARDTIME</name>
							<description>Extra guard time. No extra guard time (0x0) results in a
								standard guard time as defined in ISO 7816-3, depending on the
								protocol type. A guard time of 0xFF indicates a minimal guard time
								as defined for the selected protocol.</description>
							<bitRange>[15:8]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:16]</bitRange>

