SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>RS485CTRL</name>
					<description>RS-485/EIA-485 Control. Contains controls to configure various
						aspects of RS-485/EIA-485 modes.</description>
					<addressOffset>0x04C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NMMEN</name>
							<description>NMM enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>NMMEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is
										enabled. In this mode, an address is detected when a
										received byte causes the USART to set the parity error and
										generate an interrupt. See Section 20.6.18 RS-485/EIA-485
										modes of operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXDIS</name>
							<description>Receiver enable.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>RXDIS</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AADEN</name>
							<description>AAD enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>AADEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>DCTRL</name>
							<description>Direction control for DIR pin.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>DCTRL</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Auto Direction Control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Auto Direction Control.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OINV</name>
							<description>Direction control pin polarity. This bit reverses the
								polarity of the direction control signal on the DIR pin.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>OINV</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low. The direction control pin will be driven to
										logic 0 when the transmitter has data to be sent. It will be
										driven to logic 1 after the last bit of data has been
										transmitted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High. The direction control pin will be driven to
										logic 1 when the transmitter has data to be sent. It will be
										driven to logic 0 after the last bit of data has been
										transmitted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved
								bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>RS485ADRMATCH</name>
					<description>RS-485/EIA-485 address match. Contains the address match value for
						RS-485/EIA-485 mode.</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADRMATCH</name>
							<description>Contains the address match value.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RS485DLY</name>
					<description>RS-485/EIA-485 direction control delay.</description>
					<addressOffset>0x054</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLY</name>
							<description>Contains the direction control (U4OE) delay value. This
								register works in conjunction with an 8-bit counter.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNCCTRL</name>
					<description>Synchronous mode control register.</description>
					<addressOffset>0x058</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SYNC</name>
							<description>Enables synchronous mode.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>SYNC</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSRC</name>
							<description>Clock source select.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>CSRC</name>
								<enumeratedValue>
									<name>SLAVE</name>
									<description>Synchronous slave mode (SCLK in)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASTER</name>
									<description>Synchronous master mode (SCLK out)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FES</name>
							<description>Falling edge sampling.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>FES</name>
								<enumeratedValue>
									<name>RISING</name>
									<description>RxD is sampled on the rising edge of SCLK</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>RxD is sampled on the falling edge of SCLK</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSBYPASS</name>
							<description>Transmit synchronization bypass in synchronous slave mode.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>TSBYPASS</name>
								<enumeratedValue>
									<name>NO_BYPASS</name>
									<description>The input clock is synchronized prior to being used
										in clock edge detection logic.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BYPASS</name>
									<description>The input clock is not synchronized prior to being
										used in clock edge detection logic. This allows for a high
										er input clock rate at the expense of potential
										metastability.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSCEN</name>
							<description>Continuous master clock enable (used only when CSRC is 1)</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>CSCEN</name>
								<enumeratedValue>
									<name>SEND_ONLY</name>
									<description>SCLK cycles only when characters are being sent on
										TxD</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONTINUOUS</name>
									<description>SCLK runs continuously (characters can be received
										on RxD independently from transmission on TxD)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSSDIS</name>
							<description>Start/stop bits</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>SSSDIS</name>
								<enumeratedValue>
									<name>SEND</name>
									<description>Send start and stop bits as in other modes.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_SEND</name>
									<description>Do not send start/stop bits.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCCLR</name>
							<description>Continuous clock clear</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>CCCLR</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>CSCEN is under software control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Hardware clears CSCEN after each character is
										received.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:6]</bitRange>

