SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>RUN1</name>
							<description>Stops/starts timer channel 1.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>RUN1</name>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CENTER1</name>
							<description>Edge/center aligned operation for channel 1.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>CENTER1</name>
								<enumeratedValue>
									<name>EDGE</name>
									<description>Edge-aligned.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER</name>
									<description>Center-aligned.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLA1</name>
							<description>Selects polarity of the MCOA1 and MCOB1 pins.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>POLA1</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Passive state is LOW, active state is HIGH.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Passive state is HIGH, active state is LOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE1</name>
							<description>Controls the dead-time feature for channel 1.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>DTE1</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Dead-time disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Dead-time enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUP1</name>
							<description>Enable/disable updates of functional registers for channel
								1 (see Section 24.8.2).</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>DISUP1</name>
								<enumeratedValue>
									<name>UPDATE</name>
									<description>Functional registers are updated from the write
										registers at the end of each PWM cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOUPDATE</name>
									<description>Functional registers remain the same as long as the
										timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:13]</bitRange>

						</field>
						<field>
							<name>RUN2</name>
							<description>Stops/starts timer channel 2.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>RUN2</name>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CENTER2</name>
							<description>Edge/center aligned operation for channel 2.</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>CENTER2</name>
								<enumeratedValue>
									<name>EDGE</name>
									<description>Edge-aligned.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER</name>
									<description>Center-aligned.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLA2</name>
							<description>Selects polarity of the MCOA2 and MCOB2 pins.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>POLA2</name>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>Passive state is LOW, active state is HIGH.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Passive state is HIGH, active state is LOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE2</name>
							<description>Controls the dead-time feature for channel 1.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>DTE2</name>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Dead-time disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Dead-time enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUP2</name>
							<description>Enable/disable updates of functional registers for channel
								2 (see Section 24.8.2).</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>DISUP2</name>
								<enumeratedValue>
									<name>UPDATE</name>
									<description>Functional registers are updated from the write
										registers at the end of each PWM cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOUPDATE</name>
									<description>Functional registers remain the same as long as the
										timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[28:21]</bitRange>

