SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
						<field>
							<name>DIRECTION</name>
							<description>Data transfer direction</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>DIRECTION</name>
								<enumeratedValue>
									<name>TO_CARD</name>
									<description>From controller to card.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TO_CONTROLLER</name>
									<description>From card to controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Data transfer mode</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>MODE</name>
								<enumeratedValue>
									<name>BLOCK</name>
									<description>Block data transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STREAM</name>
									<description>Stream data transfer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAENABLE</name>
							<description>Enable DMA</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>DMAENABLE</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>DMA disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>DMA enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BLOCKSIZE</name>
							<description>Data block length</description>
							<bitRange>[7:4]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>DATACNT</name>
					<description>Data counter.</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATACOUNT</name>
							<description>Remaining data</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status register.</description>
					<addressOffset>0x034</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMDCRCFAIL</name>
							<description>Command response received (CRC check failed).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DATACRCFAIL</name>
							<description>Data block sent/received (CRC check failed).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CMDTIMEOUT</name>
							<description>Command response timeout.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DATATIMEOUT</name>
							<description>Data timeout.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>TXUNDERRUN</name>
							<description>Transmit FIFO underrun error.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RXOVERRUN</name>
							<description>Receive FIFO overrun error.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CMDRESPEND</name>
							<description>Command response received (CRC check passed).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CMDSENT</name>
							<description>Command sent (no response required).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DATAEND</name>
							<description>Data end (data counter is zero).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>STARTBITERR</name>
							<description>Start bit not detected on all data signals in wide bus
								mode.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DATABLOCKEND</name>
							<description>Data block sent/received (CRC check passed).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CMDACTIVE</name>
							<description>Command transfer in progress.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>TXACTIVE</name>
							<description>Data transmit in progress.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>RXACTIVE</name>
							<description>Data receive in progress.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>TXFIFOHALFEMPTY</name>
							<description>Transmit FIFO half empty.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>RXFIFOHALFFULL</name>
							<description>Receive FIFO half full.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>TXFIFOFULL</name>
							<description>Transmit FIFO full.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RXFIFOFULL</name>
							<description>Receive FIFO full.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>TXFIFOEMPTY</name>
							<description>Transmit FIFO empty.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RXFIFOEMPTY</name>
							<description>Receive FIFO empty.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>TXDATAAVLBL</name>
							<description>Data available in transmit FIFO.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RXDATAAVLBL</name>
							<description>Data available in receive FIFO.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLEAR</name>
					<description>Clear register.</description>
					<addressOffset>0x038</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CMDCRCFAILCLR</name>
							<description>Clears CmdCrcFail flag.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DATACRCFAILCLR</name>
							<description>Clears DataCrcFail flag.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CMDTIMEOUTCLR</name>
							<description>Clears CmdTimeOut flag.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DATATIMEOUTCLR</name>
							<description>Clears DataTimeOut flag.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>TXUNDERRUNCLR</name>
							<description>Clears TxUnderrun flag.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RXOVERRUNCLR</name>
							<description>Clears RxOverrun flag.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CMDRESPENDCLR</name>
							<description>Clears CmdRespEnd flag.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CMDSENTCLR</name>
							<description>Clears CmdSent flag.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DATAENDCLR</name>
							<description>Clears DataEnd flag.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>STARTBITERRCLR</name>
							<description>Clears StartBitErr flag.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DATABLOCKENDCLR</name>
							<description>Clears DataBlockEnd flag.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MASK0</name>
					<description>Interrupt 0 mask register.</description>
					<addressOffset>0x03C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MASK0</name>
							<description>Mask CmdCrcFail flag.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MASK1</name>
							<description>Mask DataCrcFail flag.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>MASK2</name>
							<description>Mask CmdTimeOut flag.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>MASK3</name>
							<description>Mask DataTimeOut flag.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>MASK4</name>
							<description>Mask TxUnderrun flag.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>MASK5</name>
							<description>Mask RxOverrun flag.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>MASK6</name>
							<description>Mask CmdRespEnd flag.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>MASK7</name>
							<description>Mask CmdSent flag.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>MASK8</name>
							<description>Mask DataEnd flag.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>MASK9</name>
							<description>Mask StartBitErr flag.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>MASK10</name>
							<description>Mask DataBlockEnd flag.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>MASK11</name>
							<description>Mask CmdActive flag.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>MASK12</name>
							<description>Mask TxActive flag.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>MASK13</name>
							<description>Mask RxActive flag.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>MASK14</name>
							<description>Mask TxFifoHalfEmpty flag.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>MASK15</name>
							<description>Mask RxFifoHalfFull flag.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>MASK16</name>
							<description>Mask TxFifoFull flag.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>MASK17</name>
							<description>Mask RxFifoFull flag.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>MASK18</name>
							<description>Mask TxFifoEmpty flag.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>MASK19</name>
							<description>Mask RxFifoEmpty flag.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>MASK20</name>
							<description>Mask TxDataAvlbl flag.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>MASK21</name>
							<description>Mask RxDataAvlbl flag.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOCNT</name>
					<description>FIFO Counter.</description>
					<addressOffset>0x048</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATACOUNT</name>
							<description>Remaining data</description>
							<bitRange>[14:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:15]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-15</dimIndex>
					<name>FIFO%s</name>
					<description>Data FIFO Register.</description>
					<addressOffset>0x080</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>FIFO data.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
