SakiiCode/lpc178x7x-pac/LPC178x7x-mod.svd
						</field>
					</fields>
				</register>
				<register>
					<name>EXTPOLAR</name>
					<description>External Interrupt Polarity Register</description>
					<addressOffset>0x14C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXTPOLAR0</name>
							<description>External interrupt polarity for EINT0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>EXTPOLAR0</name>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Low-active or falling-edge sensitive (depending on
										EXTMODE0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>High-active or rising-edge sensitive (depending on
										EXTMODE0).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTPOLAR1</name>
							<description>External interrupt polarity for EINT1.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>EXTPOLAR1</name>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Low-active or falling-edge sensitive (depending on
										EXTMODE1).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>High-active or rising-edge sensitive (depending on
										EXTMODE1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTPOLAR2</name>
							<description>External interrupt polarity for EINT2.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>EXTPOLAR2</name>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Low-active or falling-edge sensitive (depending on
										EXTMODE2).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>High-active or rising-edge sensitive (depending on
										EXTMODE2).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTPOLAR3</name>
							<description>External interrupt polarity for EINT3.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>EXTPOLAR3</name>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>Low-active or falling-edge sensitive (depending on
										EXTMODE3).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>High-active or rising-edge sensitive (depending on
										EXTMODE3).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>RSID</name>
					<description>Reset Source Identification Register</description>
					<addressOffset>0x180</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>POR</name>
							<description>Assertion of the POR signal sets this bit, and clears all
								of the other bits in this register. But if another Reset signal
								(e.g., External Reset) remains asserted after the POR signal is
								negated, then its bit is set. This bit is not affected by any of the
								other sources of Reset.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EXTR</name>
							<description>Assertion of the external RESET signal sets this bit. This
								bit is cleared only by software or POR.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>WDTR</name>
							<description>This bit is set when the Watchdog Timer times out and the
								WDTRESET bit in the Watchdog Mode Register is 1. This bit is cleared
								only by software or POR.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>BODR</name>
							<description>This bit is set when the VDD(REG)(3V3) voltage reaches a
								level below the BOD reset trip level (typically 1.85 V under nominal
								room temperature conditions). If the VDD(REG)(3V3) voltage dips from
								the normal operating range to below the BOD reset trip level and
								recovers, the BODR bit will be set to 1. If the VDD(REG)(3V3)
								voltage dips from the normal operating range to below the BOD reset
								trip level and continues to decline to the level at which POR is
								asserted (nominally 1 V), the BODR bit is cleared. If the
								VDD(REG)(3V3) voltage rises continuously from below 1 V to a level
								above the BOD reset trip level, the BODR will be set to 1. This bit
								is cleared only by software or POR. Note: Only in the case where a
								reset occurs and the POR = 0, the BODR bit indicates if the
								VDD(REG)(3V3) voltage was below the BOD reset trip level or not.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SYSRESET</name>
							<description>This bit is set if the processor has been reset due to a
								system reset request, as described in Section 40.4.3.6 Application
								Interrupt and Reset Control Register. Setting the SYSRESETREQ bit in
								the Cortex-M3 AIRCR register causes a chip reset in the
								LPC178x/177x. This bit is cleared only by software or POR.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>LOCKUP</name>
							<description>This bit is set if the processor has been reset due to a
								lockup, as described in Section 40.3.4.4 Lockup. The lockup state
								causes a chip reset in the LPC178x/177x. This bit is cleared only by
								software or POR.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MATRIXARB</name>
					<description>Matrix arbitration register</description>
					<addressOffset>0x188</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PRI_ICODE</name>
							<description>I-Code bus priority. Should be lower than PRI_DCODE for
								proper operation.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PRI_DCODE</name>
							<description>D-Code bus priority.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>PRI_SYS</name>
							<description>System bus priority.</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>PRI_GPDMA</name>
							<description>General Purpose DMA controller priority.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>PRI_ETH</name>
							<description>Ethernet DMA priority.</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>PRI_LCD</name>
							<description>LCD DMA priority.</description>
							<bitRange>[11:10]</bitRange>
						</field>
						<field>
							<name>PRI_USB</name>
							<description>USB DMA priority.</description>
							<bitRange>[13:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:14]</bitRange>
						</field>
						<field>
							<name>ROM_LAT</name>
							<description>ROM latency select. Should always be 0.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:17]</bitRange>
						</field>
					</fields>
				</register>

				<register>
					<name>SCS</name>
					<description>System Control and Status</description>
					<addressOffset>0x1A0</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EMCSC</name>
							<description>EMC Shift Control. Controls how addresses are output on the
								EMC address pins for static memories. Also see Section 10.9 in the
								EMC chapter.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>EMCSC</name>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Static memory addresses are shifted to match the
										data bus width. For example, when accessing a 32-bit wide
										data bus, the address is shifted right 2 places such that
										bit 2 is the LSB. In this mode, address bit 0 for the this
										device is connected to address bit 0 of the memory device,
										thus simplifying memory connections. This also makes a
										larger memory address range possible, because additional
										upper address bits can appear on the higher address pins due
										to the shift.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Static memory addresses are always output as byte
										addresses regardless of the data bus width. For example,
										when word data is accessed on a 32-bit bus, address bits 1
										and 0 will always be 0. In this mode, one or both lower
										address bits may not be connected to memories that are part
										of a bus that is wider than 8 bits. This mode matches the
										operation of LPC23xx and LPC24xx devices.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMCRD</name>
							<description>EMC Reset Disable[1]. External Memory Controller Reset
								Disable. Also see Section 10.8 in the EMC chapter.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>EMCRD</name>
								<enumeratedValue>
									<name>ANY_RESET</name>
									<description>Both EMC resets are asserted when any type of chip
										reset event occurs. In this mode, all registers and
										functions of the EMC are initialized upon any reset
										condition.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWR_ONLY</name>
									<description>Many portions of the EMC are only reset by a
										power-on or brown-out event, in order to allow the EMC to
										retain its state through a warm reset (external reset or
										watchdog reset). If the EMC is configured correctly,
										auto-refresh can be maintained through a warm reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMCBC</name>
							<description>External Memory Controller burst control. Also see Section
								10.10 in the EMC chapter.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>EMCBC</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Burst enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Burst disabled. This mode can be used to prevent
										multiple sequential accesses to memory mapped I/O devices
										connected to EMC static memory chip selects. These
										unrequested accesses can cause issues with some I/O devices.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCIPWRAL</name>
							<description>MCIPWR Active Level[1]. Selects the active level of the SD
								card interface signal SD_PWR.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>MCIPWRAL</name>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>SD_PWR is active low (inverted output of the SD
										Card interface block).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>SD_PWR is active high (follows the output of the SD
										Card interface block).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCRS</name>
							<description>Main oscillator range select.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>OSCRS</name>
								<enumeratedValue>
									<name>FROM_1_TO_20</name>
									<description>The frequency range of the main oscillator is 1 MHz
										to 20 MHz.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FROM_15_TO_25</name>
									<description>The frequency range of the main oscillator is 15
										MHz to 25 MHz.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCEN</name>
							<description>Main oscillator enable.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>OSCEN</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The main oscillator is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The main oscillator is enabled, and will start up
										if the correct external circuitry is connected to the XTAL1
										and XTAL2 pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCSTAT</name>
							<description>Main oscillator status.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>OSCSTAT</name>
								<enumeratedValue>
									<name>NOT_READY</name>
									<description>The main oscillator is not ready to be used as a
										clock source.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READY</name>
									<description>The main oscillator is ready to be used as a clock
										source. The main oscillator must be enabled via the OSCEN
										bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:7]</bitRange>

